[
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1140,
            "description": "This course is an introduction to the philosophy of mind and cognitive science. Students meet in small sections to have class discussions and debates about questions like: What are minds? Are minds physical or non-physical? Do humans have free will? Does reliance on technology turn humans into cyborgs? How close are humans to building an intelligent robot or machine? Do we want this to be a goal? Students will learn how make a philosophical argument, and how to express them in writing or through an oral presentation.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Minds And Machines",
            "prefix": "IHSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3705
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1972,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Ai And Society",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3706
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1235,
            "description": "The Aristotelian dictum that we are rational animals is under severe attack these days. In fact, the previous sentence may seriously understate the situation: the dictum is perhaps outright rejected by many, if not most. From psychologists of reasoning and decision-making to behavioral economists to the “new atheists” (all groups whose message we will consider in this class), the onslaught is firmly underway, and fierce",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Are Humans Rational?",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3707
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2120,
            "description": "This course is an introduction to the new and quickly growing field of cognitive science. Cognitive Science is a highly interdisciplinary field of study of mind at the intersection of philosophy, psychology, computer science, neuroscience, linguistics, and anthropology.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Introduction To Cognitive Science",
            "prefix": "COGS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3708
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4210,
            "description": "Recent advances in Cognitive Science, Computer Science and Mathematics, have resulted in the ability to develop computer programs that implement Probabilistic Cognitive Models (PCMs). The cognitive models that this course covers are based on approximate Bayesian Inference implemented by Markov Chain Monte Carlo and Variational techniques that have made this approach tractable. The objective of this course is to enable the student to develop models of cognition in a Bayesian framework.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Cognitive Modeling",
            "prefix": "COGS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3709
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4410,
            "description": "Research in Cognitive Science and Artificial Intelligence (AI) is driven by data. Researchers in these fields collect, manipulate, model and analyze data generated by real-world processes.  Since the amount of data available has grown exponentially, the ability to automate these tasks through computer programs is essential. Specifically, probabilistic and statistical computing are needed to learn from the data. The objectives of this course are for the student to perform exploratory data analysis and to acquire the basics of statistical and machine learning in order to model real-world datasets.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Programming For Cognitive Science And Artificial Intelligence",
            "prefix": "COGS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3710
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4420,
            "description": "This course introduces students to basic concepts and methods of artificial intelligence and their applications in computer games. The topics include decision making, movement, path finding, and AI for human-like characters. This course will take the form of a combination of lectures, presentations by students, class discussions, and independent study.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Game Ai",
            "prefix": "COGS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3711
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4640,
            "description": "This course introduces various computational approaches for creating intelligent conversational agents. This course will take the form of a combination of lectures, presentations by students, class discussions, and independent study.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Intelligent Virtual Agents",
            "prefix": "COGS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3712
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4880,
            "description": "This course will concentrate on the knowledge-based modeling of intelligent agents, with a special emphasis on semantically-oriented language processing. Theoretical and conceptual discussions will be balanced by practical work within the implemented OntoAgent cognitive architecture. It will discuss the modeling of decision-making, the various aspects of natural-language processing, and the art of knowledge engineering.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Language-Endowed Intelligent Agents",
            "prefix": "COGS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3713
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4960,
            "description": "An advanced course concerned with selected topics in cognitive science.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Learning And Advanced Game Ai",
            "prefix": "COGS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3714
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4960,
            "description": "An advanced course concerned with selected topics in cognitive science.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Artificial Intelligent Agents",
            "prefix": "COGS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3715
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4960,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Ethics Of Ai",
            "prefix": "PHIL",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3716
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4961,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Intermediate Formal Logic & Ai",
            "prefix": "PHIL",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3717
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 1050,
            "description": "A survey of visual arts from Paleolithic Era to today. Materials are presented in a form accessible to students without previous knowledge of Art History.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Art History",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3718
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1080,
            "description": "The question of “what is jazz” remains a lively and contentious discussion to this day. This course charts the emergence, evolution, and influence of jazz music, as well as the many controversial musical, social, and philosophical questions it continues to provoke. The work of influential figures in American and European improvised music will be examined in detail, and the continuing development of jazz-inspired contemporary practices will be explored.\r\n\r\nThrough listening, analysis, discussion, writing, and creative projects, students will develop a greater appreciation and understanding of improvised music in a great variety of contexts, and the crucial role American jazz played in revitalizing improvisational practice throughout the 20th and 21st Centuries. By the end of the course, students will be able to identify major figures in jazz and improvised music, identify different styles and eras, and have a basic vocabulary for discussing music both analytically and in personal responses",
            "fall": 1,
            "major_restrictive": 0,
            "name": "History Of Jazz And Improv Music",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3719
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1300,
            "description": "This course will investigate the emergence and transformations of the concept of race in the history and culture of the United States by analyzing films. Hollywood classics will be featured, and will also be contrasted with documentary and independent films. The course will focus on social and political contexts, as well as the film’s critical reception and film form.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Race And Film In Us Culture And History",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3720
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1170,
            "description": "This course is an exploration of the history of animation. We will begin with a look at precursors to the medium, its formation, and development, trace its development through both mainstream and experimental animation, to the current state of the medium across film, interactive media and other forms. The course will be based around screenings, readings, discussions and response and research papers.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "History Of Animation",
            "prefix": "IHSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3721
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1700,
            "description": "A course designed for students to develop their own voice as a songwriter. The course surveys the methods of successful songwriters, highlighting aspects of melody, lyrics, harmonic progression, story-telling, audience, and social context. Students develop a portfolio of their own original songs and lyrics, presented weekly and performed in a studio or live setting at the end of the term.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Songwriting Workshop",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3722
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1960,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Back To The 60’S",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3723
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2500,
            "description": "This course surveys multiple approaches to the  Western art music traditions from a contemporary global, multicultural context. The inter-relationships between music, society and cultural forces is emphasized. Students learn to recognize and describe the basic components of music, like texture, tonality, rhythm, dynamics, and melody Lectures are supplemented by listening assignments and in-class demonstrations.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "History Of Western Music",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3724
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2540,
            "description": "This course will survey the history and theory of the diverse artistic practices of the twentieth century in relation to the development of the mass media and new technologies. Topics will include the Bauhaus, Surrealism, Pop Art, and Postmodernism and will span a spectrum of media from the more traditional, such as painting and photography, to electronic and new media, such as video and digital arts.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "The Multimedia Century",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3725
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4130,
            "description": "This course asks what is really new about New Media, and looks at creative practices, theoretical discourses, and social contexts to find answers. The course concentrates on cutting edge cultural expression using information and communication technologies. The objective to equip students with multiple perspectives - aesthetic, communications, historical - with which to analyze, critique, and develop original concepts about the uses of new media in art and culture.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "New Media Theory",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3726
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 1200,
            "description": "This course embraces the science of psychology.  The aim is for students to learn how using the scientific method provides important insights about mind, brain, and behavior.  This course integrates research on neuroscience throughout all the standard topics in an introductory course in psychology.  The course presents advances across all subfields of psychology.  In addition to standard exams, there are online assignments for each chapter and online laboratory experiences.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Intro To Psychological Science",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3727
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 19,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Understanding Empathy",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3728
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4320,
            "description": "This course is an introduction to the role of physiological mechanisms in behavioral processes. There will be detailed examination and discussion of the involvement of biological systems in feeding and drinking, sexual behavior, sleep and arousal, learning and memory, psychopathology and psychopharmacology.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Behavioral Neuroscience",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3729
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4360,
            "description": "This course is an introduction to the role of physiological mechanisms in behavioral processes. There will be detailed examination and discussion of the involvement of biological systems in feeding and drinking, sexual behavior, sleep and arousal, learning and memory, psychopathology and psychopharmacology.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Behavioral Neuroscience",
            "prefix": "COGS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3730
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4330,
            "description": "This survey course is intended as an introduction to Cognitive Neuroscience. The topics covered will focus on exploring the neural underpinnings for cognitive processes, such as sensation, language, attention, motor control, executive functions, social communication, emotions, consciousness, and learning/memory. Basic aspects of nervous system function and neuroanatomy, brain development/evolution, structural and functional imaging techniques, and other research methods used in Cognitive Neuroscience will be discussed.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Introduction To Cognitive Neuroscience",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3731
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4330,
            "description": "This survey course is intended as an introduction to Cognitive Neuroscience. The topics covered will focus on exploring the neural underpinnings for cognitive processes, such as sensation, language, attention, motor control, executive functions, social communication, emotions, consciousness, and learning/memory. Basic aspects of nervous system function and neuroanatomy, brain development/evolution, structural and functional imaging techniques, and other research methods used in Cognitive Neuroscience will be discussed.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Introduction To Cognitive Neuroscience",
            "prefix": "COGS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3732
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4500,
            "description": "This course is an exploration of the social and psychological effects of extensive use of pharmacological agents that are salient to daily behavior. There is an emphasis on the effects of addictive drugs such as alcohol, heroin, and cocaine.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Drugs, Society, And Behavior",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3733
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4600,
            "description": "Perception and thought are considered in terms of processes represented in the brain. The localization and lateralization of function are examined, drawing upon research on the behavioral effects of brain damage as well as brain-imaging studies and other approaches. Examples of topics include object recognition, memory, language, emotion, spatial ability, and motor processes.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Cognition And The Brain",
            "prefix": "PSYC",
            "spring": 0,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3734
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4600,
            "description": "Perception and thought are considered in terms of processes represented in the brain. The localization and lateralization of function are examined, drawing upon research on the behavioral effects of brain damage as well as brain-imaging studies and other approaches. Examples of topics include object recognition, memory, language, emotion, spatial ability, and motor processes.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Cognition And The Brain",
            "prefix": "COGS",
            "spring": 0,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3735
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4610,
            "description": "This seminar course is a detailed examination of the mind-brain relationship, through study of the stress response. Stress is simply defined as any challenge to an individual’s homeostasis, or balance. This course will explore the neurobiological underpinnings of the stress response, with particular focus on how stressors can alter perception, affective and cognitive processing in the individual, which can in turn feedback to alter the general health of the individual (body and mind/brain).",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Stress And The Brain",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3736
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4610,
            "description": "This seminar course is a detailed examination of the mind-brain relationship, through study of the stress response. Stress is simply defined as any challenge to an individual’s homeostasis, or balance. This course will explore the neurobiological underpinnings of the stress response, with particular focus on how stressors can alter perception, affective and cognitive processing in the individual, which can in turn feedback to alter the general health of the individual (body and mind/brain).",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Stress And The Brain",
            "prefix": "COGS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3737
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4700,
            "description": "This course will examine hormone and brain/behavior relationships across the lifespan. Hormones are molecules that are secreted by glands (the majority of which are located outside the brain) and have distal effects on their targets, such as the brain, throughout development. A focus will be on hormones’ effects, mechanisms, and brain regions of interest for behavior and cognitive processes, such as perception, learning/memory, social cognition, motivation, and emotion.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Hormones, Brain, And Behavior",
            "prefix": "PSYC",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3738
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4700,
            "description": "This course will examine hormone and brain/behavior relationships across the lifespan. Hormones are molecules that are secreted by glands (the majority of which are located outside the brain) and have distal effects on their targets, such as the brain, throughout development. A focus will be on hormones’ effects, mechanisms, and brain regions of interest for behavior and cognitive processes, such as perception, learning/memory, social cognition, motivation, and emotion.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Hormones, Brain, And Behavior",
            "prefix": "COGS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3739
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 1010,
            "description": "This course assumes no previous knowledge of the subject. The course is designed to provide students with fundamental skills in listening, speaking, reading, and writing Mandarin Chinese. Oral and aural skills will be emphasized. Background on Chinese culture will be introduced as an element of the course. For entry level, non-native speakers only.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Chinese I",
            "prefix": "LANG",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3740
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2340,
            "description": "This is a continuation of Chinese I, a course for the standard modern Chinese language (Mandarin). Students learn more Chinese characters and words, reach a total of nearly 500 characters and 650 words, and use more complicated grammatical structures, including some compliment phrases and topic-comment sentences. In sum, students will learn more in all four aspects—listening, speaking, reading, and writing—presented in Chinese I.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Chinese Ii",
            "prefix": "LANG",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3741
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4420,
            "description": "This is a continuation of Chinese II, a course for the standard modern Chinese language (Mandarin). Students learn more Chinese characters and words, reach a total of about 650 characters, 1000 words, and use more complicated grammatical structures, e.g., reduplication of adjectives and verbs, resultative and potential compliments. In sum, students learn more in all four aspects—listening, speaking, reading and writing—presented in Chinese II.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Chinese Iii",
            "prefix": "LANG",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3742
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4430,
            "description": "This is a continuation of Chinese III, a course for standard modern Chinese language (Mandarin). Students learn additional Chinese characters and words, reach a total of about 800 characters, 1350 words, and complicated grammatical structures, e.g., expression of approximation, comparison of structural and aspect particles, etc. In sum, students learn more in all four aspects—listening, speaking, reading, and writing—presented in Chinese III.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Chinese Iv",
            "prefix": "LANG",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3743
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4470,
            "description": "Chinese V is a continuation of Chinese IV, a course for standard modern Chinese language (Mandarin). Students learn additional Chinese characters and words, reach a total of about 950 characters, 1700 words, and complicated grammatical structures, e.g., idiomatic expressions, expressions of comparison, concession, and subjection, etc. In sum, students learn more in all four aspects – listening, speaking, reading and writing – presented in Chinese IV.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Chinese V",
            "prefix": "LANG",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3744
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 1020,
            "description": "This course introduces students to digital photography, Web design, and interactive multimedia in making art. Students broaden their understanding of such topics as composition, effective use of images, color theory, typography, and narrative flow. Inquiry and experimentation are encouraged, leading towards the development of the skill and techniques needed to create visual art with electronic media.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Digital Imaging",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3745
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 1030,
            "description": "This is a hands-on introduction to film making. Students study a selection of great films; and learn how to make movies using lightweight field production equipment. Throughout the course students produce a variety of short videos in different genres, and develop their critical capacity for analyzing cinema and other forms of motion picture storytelling. The class ends with a mini film festival where everyone presents their work.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Digital Filmmaking",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3746
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 1380,
            "description": "This course is a hands-on introduction to the primary building blocks of music and musicianship in a 21st Century context. The course will explore acoustics and psychoacoustics, rhythm, pitch, harmony, melody, timbre, improvisation, composition, and music notation through engaged listening practices and creative projects. No formal musical background is expected.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Fundamentals Of Music And Sound",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3747
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1040,
            "description": "Documentary in the 21st Century: Identity Production is a production course investigating the course of documentary history leading to a focus on digital media representations today. This course will incorporate critical thinking with production.  With focus on aesthetic and formal considerations, students will be asked to produce a series of multimedia projects investigating their vision of themselves in the world.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Documentary In The 21St Century: Identity Production",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3748
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1540,
            "description": "Design is and has been a means to solve problems by addressing how the materiality of form enhances function. Through a historical perspective this course will discover how design shapes, and is shaped by, culture and society. Sampling a range of fields, including graphics, architecture, and fashion, the course considers how design thinking takes on challenges from the most mundane to complex social or environmental concerns. While many see design as an artistic or decorative practice, this course will recognize the impact of design’s interconnection with economics, politics, and culture.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "History Of Design",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3749
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 19,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Game Sound And Musical Play",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3750
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 19,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Remixing In Digital Culture",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3751
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 19,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Worlds On Display",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3752
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2210,
            "description": "A beginning sculpture course combining hands-on studio work sessions with lectures on the history and theory of sculpture practice. The studio component involves explorations of materials and techniques as tools for the enhancing of visual sensitivity and creative expression.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Sculpture I",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3753
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2220,
            "description": "An introductory course which will present basic concepts about composition, line, pictorial space, light, and color in the visual arts in order to help students develop the means for expressing visual ideas effectively. Weekly homework design projects, using both traditional and electronic media, will be complemented by in-class slide lectures, videos, and critiques.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Fundamentals Of 2D Design",
            "prefix": "ARTS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3754
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2380,
            "description": "This is the first course in a two-course sequence in music theory and aural skills. The course covers the fundamentals of diatonic harmony and two-part species counterpoint. Aural skills include interval, scale and chord identification, rhythmic and tonal solfege, and dictation. Learning activities include weekly assignments in analysis, composition, performance, improvisation, and self-paced use of software in the acquisition of aural skills.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Music And Sound I",
            "prefix": "ARTS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3755
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2700,
            "description": "An introductory studio course covering the principles of critical listening, psychoacoustics, the art of music recording, and the basic use of digital equipment for music production and post-production. Hands-on assignments in a professional sound facility will be combined with readings and historical examples drawing on popular and experimental styles.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Sound Recording And Production I",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3756
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2960,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Radical Graphics / Screenprinting",
            "prefix": "ARTS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3757
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4210,
            "description": "An advanced studio course in sculpture for students who have taken Sculpture I. Students are encouraged to explore personal areas of interest and are required to develop a familiarity with the history of sculpture as well as mastering fabrication techniques.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Sculpture Ii",
            "prefix": "ARTS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3758
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4960,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "History And Analysis Of Western Music",
            "prefix": "ARTS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3759
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Performance Art",
            "prefix": "ARTS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3760
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4620,
            "description": "Covers cognitive theory from an applied perspective to understand and predict the interactions among human cognition, artifact (i.e., tools), and task. Cognitive task analysis techniques will be taught and used throughout the course, as will techniques for collecting and analyzing fine-grained behavioral data. Topics covered may include visual search and visual attention, cognitive skill and its acquisition, hard and soft constraints on interactive behavior, human error, soft constraints on judgment and decision-making, and experts and expertise.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Cognitive Engineering",
            "prefix": "COGS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3761
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2660,
            "description": "This course introduces students to the practice of graphic design with a variety of hands-on projects. Studies include the principles and theories of 2D design and the integration of form, color, type, image, and content. Students will develop a heightened visual awareness and an understanding of how design influences meaning. The course emphasizes strategic and critical thinking in the solving of graphic design problems for the purposes of professional communication across a range of media platforms.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Introduction To Graphic Design",
            "prefix": "COMM",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3762
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2570,
            "description": "Typography studies the form and function of alphabetic and pictographic systems in English-speaking society. The course aims to imbue in students a critical perspective on the role typography plays in the history and sustenance of civilization and the propagation of ideas throughout society. Students will read historical, theoretical, and evidence-based literature to glean principles for designing communicatively effective type. Verbal and visual assignments will enforce understanding of typographic principles and grammar for use in print and digital interfaces.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Typography",
            "prefix": "COMM",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3763
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2640,
            "description": "Color, the most relative of all visual attributes, is explored in this studio course through a series of exercises and graphic design problems. Course topics include: recollection and visual memory, reading and contexture, relativity and subjectivity, color and light, color and communication, and “cultural” color. We will place an emphasis on the work and theories of Joseph Albers.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Color Theory",
            "prefix": "COMM",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3764
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4320,
            "description": "This studio course explores new directions in art and design that include visual poetry (visual expression in which they shape an arrangement of text, images, symbols to convey the message) and interactive narrative. Visual poetics and narrative appear in advertisement, music videos, and other forms of communication. Students will experiment with these forms of communication and learn how these concepts apply in artistic and commercial contexts. The class format includes lectures, discussions, and studio work.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Visual Poetics And Narrative",
            "prefix": "COMM",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3765
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4460,
            "description": "This course introduces students to the theoretical and practical use of graphics as a form of visual communication. Discussions include topics such as the psychology of visual perception, design theory, creative process, formatted text, and graphics. Students have an opportunity to put theory into practice using computer graphics.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Visual Design: Theory And Application",
            "prefix": "COMM",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3766
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4960,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Brand Identity Design",
            "prefix": "COMM",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3767
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2220,
            "description": "This course provides a broad introduction to the theories and principles of human performance, man-machine interfaces, and systems designs. It also emphasizes the applications of these theories and principles to the design of controls, work space, data entry devices, training systems, and the human-computer interface",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Human Factors In Design",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3768
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4290,
            "description": "Sustainability by Design will center around student-led project-based research, with a focus on getting to know one’s own specific potential, leveraging personal connections to communities, and making a difference in larger systems that can often seem intractable. Students will learn how to think and act within whole systems and design solutions that identify and push on leverage points in these systems. This process will bring analysis and design together in a multitude of ways, and the course can be thought of as a hybrid seminar/studio course, where students will learn about many design principles and practices and apply these lessons in practice, forming feedback loops between theory and action. At their best, students will transform systems from a degenerative state, to a sustainable one, and beyond to achieve regenerative systems.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Sustainability By Design",
            "prefix": "STSH",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3769
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4290,
            "description": "Sustainability by Design will center around student-led project-based research, with a focus on getting to know one’s own specific potential, leveraging personal connections to communities, and making a difference in larger systems that can often seem intractable. Students will learn how to think and act within whole systems and design solutions that identify and push on leverage points in these systems. This process will bring analysis and design together in a multitude of ways, and the course can be thought of as a hybrid seminar/studio course, where students will learn about many design principles and practices and apply these lessons in practice, forming feedback loops between theory and action. At their best, students will transform systems from a degenerative state, to a sustainable one, and beyond to achieve regenerative systems.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Sustainability By Design",
            "prefix": "STSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3770
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 1610,
            "description": "The first design studio in the Product Design and Innovation Program introduces students to general design through a series of short projects. The projects stress creative thinking and invention, observation and perception, communication and visualization, sketching, photography, model-making, and especially open-ended exploration.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Design And Innovation Studio I",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3771
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2610,
            "description": "This studio design course focuses on an enriched sense of problem definition through an emphasis on the reach and interconnectedness of technology, and the conditionality of design selection criteria. Its design exercises, readings, and discussion press beyond marginal substitutions toward a broadened sense of possibility from, for example, “hyper cars” and human-powered homes to small-scale local agriculture and extreme ecological living systems.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Design And Innovation Studio Ii",
            "prefix": "IHSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3772
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4610,
            "description": "The sixth design studio for non-engineering majors participating in the interdisciplinary programs in Design and Innovation, this course introduces students to organizational dimensions of new concept design, development, and dissemination, including entrepreneurship, organization planning, product management, and branding and marketing. The course requires students to synthesize social, technical, business, and formal concerns in the design of innovative objects, environments, or systems.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Design And Innovation Studio C",
            "prefix": "ENGR",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3775
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4610,
            "description": "Studio B focuses on an enriched sense of program and user needs definition through methodologies of the humanities and social sciences. Studio projects, presentations, and readings explore the relation of race, class, and gender to technology, and the potential of design to address societal problems. The course has often focused on incorporating information technology in educational tools for low-income primary school students.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Design And Innovation Studio B",
            "prefix": "STSH",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3773
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4610,
            "description": "The sixth design studio for non-engineering majors participating in the interdisciplinary programs in Design and Innovation, this course introduces students to organizational dimensions of new concept design, development, and dissemination, including entrepreneurship, organization planning, product management, and branding and marketing. The course requires students to synthesize social, technical, business, and formal concerns in the design of innovative objects, environments, or systems.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Design And Innovation Studio C",
            "prefix": "STSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3774
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1200,
            "description": "This course is designed to introduce a wide variety of concepts and applications in the broad subject of economics, economics being the study of people’s choices. Traditionally, these choices have been framed as how to best employ scarce resources to produce goods and services and distribute them for consumption. To describe these choices the cause will introduce the concepts of opportunity cost, demand and supply theory, and market structures. It will consider the role of government in making resource allocation choices. Students will also study important macroeconomic data such as gross domestic product, economic growth rates, inflation, and unemployment. Additionally, studied will be the role of money and banking in the economy and short-run events such as recessions and expansions. Overall, the course will provide the student with an encompassing view of how economic principles and concepts relate to the broader economy and society.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Principles Of Economics",
            "prefix": "IHSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3776
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 1200,
            "description": "This course is designed to introduce a wide variety of concepts and applications in the broad subject of economics, economics being the study of people’s choices. Traditionally, these choices have been framed as how to best employ scarce resources to produce goods and services and distribute them for consumption. To describe these choices the cause will introduce the concepts of opportunity cost, demand and supply theory, and market structures. It will consider the role of government in making resource allocation choices. Students will also study important macroeconomic data such as gross domestic product, economic growth rates, inflation, and unemployment. Additionally, studied will be the role of money and banking in the economy and short-run events such as recessions and expansions. Overall, the course will provide the student with an encompassing view of how economic principles and concepts relate to the broader economy and society.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Introductory Economics",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3777
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2010,
            "description": "This course combines demand, derived from consumer preferences, and supply, based on firms’ production functions, to establish market prices for goods and services. Calculus-based techniques are used to minimize costs and maximize utility and profits across differing industry structures. Product pricing strategies are examined. The course also provides an introduction to topics such as the pricing of stocks and bonds, game theory, positive and negative externalities, asymmetric information, and behavioral economics.\r\nApplies the microeconomic theory of the firm to price, cost, and output decisions of business enterprises under different market structures. Regression analysis of demand and cost, linear programming of production and simulation analysis of risk, and capital budgeting are also presented.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Intermediate Microeconomic Theory",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3778
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2020,
            "description": "Attention is directed primarily to variations in the aggregate volume of output, income, and employment. Cyclical fluctuations and long-term economic trends are examined and the interrelations of business and government policies are analyzed. The applicability of economic theory to the problems of business forecasting is discussed.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Intermediate Macroeconomic Theory",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3779
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2000,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Economics Elective",
            "prefix": "ECON",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3780
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4010,
            "description": "Core topics of microeconomic theory are covered: consumer demand, firm production, decisions under uncertainty, game theory, markets for goods with perfect and imperfect competition, and market failures. Microeconomic theory is applied to real cases. Examples include product pricing, technological innovation, firm growth, consumer and producer welfare, social welfare impacts of government policy, monopoly and oligopoly, and resource allocation.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Applied Microeconomics",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3781
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4110,
            "description": "Technological innovation is responsible for most economic growth and is crucial to deal with major societal concerns. This course examines the economics of innovation and new technologies. It shows how technologies are created and put to use, from basic science through invention and development to diffusion and practical use. Additional topics include R&D determinants, sources of innovation, product improvement, cost reduction, incentivizing and stimulating innovation, patents, evolution of innovation and technology, innovative competition in industry, and the national innovation environment.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Economics Of Innovation And New Technologies",
            "prefix": "ECON",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3782
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4120,
            "description": "Application of mathematical techniques to economic modeling and analysis. Construction of models to describe aspects of the economy and to analyze potential policies. Solution methods for issues including optimal choice with and without constraints, equilibria among multiple actors, marginal effects of policies, and dynamic economic models. Some mathematical maturity is assumed, and mathematical skills are taught throughout the course.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Mathematical Methods In Economics",
            "prefix": "ECON",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3783
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4130,
            "description": "Financial institutions, especially commercial banking and the Federal Reserve System, are considered from three perspectives: their monetary roles; trends in the economic, organizational, and technological aspects of their operations; and their other economic roles-a critical view. Also, the role of money in macroeconomic theory is considered along with the role of monetary policies in relation to the problems of inflation and unemployment.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Money And Banking",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3784
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4140,
            "description": "Acquaints students with the structural characteristics and philosophical foundations of enterprise and industry. Several important industries are considered from the viewpoint of market structure, conduct, and performance. Such concepts as the corporation, entrepreneurial outcomes, technological innovation, private property, and public policy toward business are examined to orient the student to contemporary industrial activity.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Structure Of Industry: Competition, Innovation, Entrepreneurship, Policy",
            "prefix": "ECON",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3785
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4150,
            "description": "Examine regulations related to the environment, intellectual property rights, healthcare, and antitrust. Examine the interaction between regulatory policies and how businesses respond to them with respect to innovation, production, and pricing. Some of the industries and markets examined to highlight the regulatory policy issues include automobiles, information technology, telecommunications and media, healthcare services, pharmaceuticals, medical devices, retail sector, high-speed rail, and taxi and ridesharing.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Economics Of Government Regulation And Firm Strategy",
            "prefix": "ECON",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3786
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4160,
            "description": "Emphasis is placed on the analysis of efficient resource use in the public sector at the federal level. Expenditure theory, tax incidence, and income distribution policies are discussed. The effects of personal income, corporation, sales, payroll, and property taxes on resource allocation, equity, and growth are considered.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Public Finance",
            "prefix": "ECON",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3787
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4170,
            "description": "Examine various facets of the healthcare industry. Application of microeconomic theory and tools will be used to: analyze healthcare demand and supply; examine the impact of public policies; study market segments such as health insurance and pharmaceuticals; explore economic choices of healthcare professionals; identify potential socioeconomic and demographic determinants of health status and healthcare; and gain insights into issues related to the ongoing healthcare policy reform.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Health Economics And Policy",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3788
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4180,
            "description": "A critical examination in which comparisons are made and contrasts emphasized between different schools of economic thinking such as classicism, marginalism, socialism, institutionalism, neoclassicism, and Keynesianism. Special attention is given to historical theories and attitudes of economists toward technological change and its impact on human welfare.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Development Of Economic Thought",
            "prefix": "ECON",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3789
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4190,
            "description": "This course investigates the significance of economic globalization, covering the following topics: international trade and financial flows, technological innovation and intellectual property, technology transfer, national government and transnational corporations, natural resources, health and the environment, impacts on selected industries and countries, and roles of the world trade organization and international monetary fund. The major controversies surrounding globalization are identified, and alternative arguments are evaluated based on available evidence.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "International Economics And Globalization",
            "prefix": "ECON",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3790
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4200,
            "description": "This course is an introduction to open economy macroeconomics and international finance. The core objective of the course is to teach students macroeconomic models and enable them to analyze international economic phenomena. Topics covered include theories of intertemporal trade, sources of global imbalances and their adjustment mechanisms, the determination of exchange rates, the effect of fiscal and monetary policies under different exchange rate regimes, balance of payment crisis, consequences of financial globalization.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Open Economy Macroeconomics",
            "prefix": "ECON",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3791
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4210,
            "description": "Addresses the identification and measurement of the economic gains and losses to different sectors of the economy resulting from public projects and policies. Among the projects studied are those in the area of transportation, energy, environment, and urban development. Also considered is the evaluation of the effects of government on business, as for example, consumer product and workplace safety regulation.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Cost-Benefit Analysis",
            "prefix": "ECON",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3792
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4220,
            "description": "Game theory has been emerging as a branch of mathematical economics and applied to analyze situations where each decision-maker needs to think strategically about others’ perspectives and actions in order to determine ones’ own optimal choice. This course provides an introduction and presents selected topics in game theory. It will look into basic definitions and equilibrium concepts and develop a wide range of applications in Economics, Biology, sports, health care, and various fields. The goal of the lecture is to improve understanding of strategic interaction in economic, business, and social situations.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Applied Game Theory",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3793
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4230,
            "description": "Develops a critical understanding of environmental issues and policy from an interdisciplinary economics perspective. Covers the economics of environmental quality including the links between the economy and the environment, the causes of environmental problems, evaluation of environmental projects and policies, and policies to address environmental issues with an emphasis on efficiency, equity, and sustainability, and the international dimensions of environmental issues.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Environmental Economics",
            "prefix": "ECON",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3794
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4240,
            "description": "Addresses the allocation of natural resources through applied study of fisheries, forestry, oil, minerals, water, and biodiversity resources. Mathematical analysis will be done using Microsoft Excel with Solver. Social and policy dynamics of allocation decisions will be explored through case studies. Field trips will address ecological and physical aspects of resource management. The intent is to develop a balanced perspective and tools to address resource management decisions across their diverse economic, social, and environmental dimensions.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Natural Resource Economics",
            "prefix": "ECON",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3795
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4250,
            "description": "This course explores the relationships between the economy and the material world. It identifies the most critical challenges to sustainable economic development on local to global scales and ways of addressing them. The course examines options surrounding material and energy flows, technological alternatives, livelihoods, consumption behavior, public policy, civil society institutions, and social movements as avenues for meeting the major challenges to sustainability.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Economy, Technology, And Sustainability",
            "prefix": "ECON",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3796
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4260,
            "description": "Introduces students to the basic analytical approaches to environmental issues and natural resource use. Emphasis is on economic valuation and public policy. Covers traditional approaches based on assumptions of economic rationality and market efficiency as well as current approaches from the fields of environmental science behavioral economics. Emphasis is on active student participation and examination of current environmental controversies.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Environmental And Resource Economics",
            "prefix": "ECON",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3797
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4270,
            "description": "Integrates theory from psychology, neuroscience, and other social sciences into traditional economic models of human behavior. By relaxing the standard assumptions of perfect rationality and selfishness, more realistic modeling features such as loss aversion, present-bias, social norms, and habit formation improve economic analyses. These techniques are used to analyze individuals’ health behaviors, health insurance markets, and healthcare policy.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Behavioral Economics",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3798
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4280,
            "description": "Examine advanced econometric and statistical methods for the analysis of high-dimensional data, otherwise known as “Big Data.” In this setting, detailed information for each unit of observation informs machine learning techniques such as classification and regression trees; random forests; penalized regressions; and boosted estimation. These prediction methods are then utilized to improve causal modeling, with applications in the study of healthcare demand and supply modeling, and behavior of consumers and businesses.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Econometric Methods For Big Data",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3799
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4290,
            "description": "Students will learn about markets related to healthcare, insurance, biopharmaceuticals, and medical devices. Examine economic issues, models and quantitative analysis related to firms’ activities in areas such as innovation, R&D expenditures, patenting, pricing, mergers and acquisitions, and competition in markets. Examine the role played by health insurance systems. Study the economic implications of regulations, such as those by the U.S. FDA. Economic and policy aspects will be examined within the context of the U.S. healthcare sector, along with selected comparisons to European national healthcare systems.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Economics Of Biotech And Medical Innovations",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3800
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4310,
            "description": "Market-based economies depend upon legal systems that establish and protect property rights. In this and many other instances the law is designed to encourage and support economic activity; in others it is designed to restrain certain types of otherwise rational economic behavior. This course will apply fundamental economic concepts, such as supply and demand, competition, monopoly, externalities, and Pareto efficiency to a range of legal topics, including contracts, torts, criminal, and intellectual property law to explain the economic motivation and consequences of the legal framework. For those students considering law school, this course offers an exposure to many of the legal concepts found in the first year law school curriculum.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Law And Economics",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3801
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4320,
            "description": "An exploration of models of decision-making under alternative assumptions, expanding on “rational” models of introductory economics. The course will discuss the assumptions of these standard models and their shortcomings. The shortcomings will be addressed through the exploration of limited attention and considerations of fairness, uncertainty, and strategic interaction. Applications in areas such as consumer and household finance, marketing, and public policy will be emphasized throughout.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Economic Models Of Decision-Making",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3802
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4330,
            "description": "This course will examine a wide range of financial markets and institutions and the micro-and macroeconomic forces that relate to them. Topics include the use of derivative securities such as future, options, and swap agreements, and their roles in distributing financial risk. The course will be driven by textbook readings, supplemented by current news stories, articles from the financial press, and research articles.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Economics Of Financial Institutions And Markets",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3803
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4340,
            "description": "This course describes how individuals and firms make financial decisions, and how those decisions might deviate from those predicted by traditional financial or economic theory. The course examines how the insights of behavioral economics complement the traditional finance paradigm by introducing some of the main psychological biases in financial decision-making and examining the impacts of these biases in financial markets and other financial settings. It will also introduce students to behavioral and experimental methodologies in finance, economics, and other disciplines.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Behavioral Financial Economics",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3804
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4350,
            "description": "This course will examine alternative models of economic and non-economic decision-making. The course will cover models of rational decision-making under certainty and uncertainty, bounded rationality, preference-based approaches (e.g., loss aversion, ambiguity aversion, disappointment aversion), and heuristic decision-making. The emphasis throughout will be on the proper interpretation of more general models of decision-making as well as real-world applications.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Microeconomics Of Decision-Making",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3805
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4360,
            "description": "This course explores human motivation and behavior across different settings and experimental paradigms. The course familiarizes students with previous work in selected topics in behavioral and experimental economics such as charitable giving, individual decision making and preferences, health, scarcity, and worker motivation. It also prepares students to design, implement and analyze their own economics experiments.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Experimental Economics",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3806
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4430,
            "description": "Dynamic models of national and international economic growth are introduced and analyzed.  Technological innovation is central to growth, and models consider the endogenous determinants of technological innovation and diffusion.  National institutions that affect growth, such as law, education, and infrastructure, are considered. Variation in intellectual property rights across countries are examined, together with their effects on economic growth and development. Theories of growth are compared to empirical fact.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Economics Of Growth & Innovation",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3807
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4570,
            "description": "This course is an introduction to econometric data analysis. The statistical methods covered enable analysis of relationships between variables in data, with special attention to identification of true casual effects. Topics covered include linear and simple nonlinear regression models, internal and external validity, methods for panel data and binary dependent variables, instrumental variable methods, use of experimental and quasi-experimental data, and basic time series methods. The course included hands-on data analysis and report writing.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Econometrics",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3808
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4580,
            "description": "This course provides skills to apply econometrics to diverse economic topics. Mathematical methods of econometrics are developed for tools such as alternative estimation strategies, instrumental variables, regression discontinuity, nonparametric and quantile estimators, and simultaneous equation models. Methods to identify causal effects are emphasized. Students do hands-on data work that puts to use these econometric tools.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Applied Econometrics",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3809
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4590,
            "description": "Covers advanced estimation and inference techniques for data analysis and policy evaluation. Topics will vary from year to year to introduce advanced statistical methods used in recent literature. Topics may include visualization techniques to summarize and display high dimensional data, selected topics in discrete choice models, spatial analysis, and analysis of panel data. Particularly, methods for panel data will be emphasized. This includes fixed, random, mixed, and multi-level effects models to control for or account for variation from individual characteristics. Dynamic panel data models consider lagged dependent variables as regressors.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Advanced Data Analytics & Policy Evaluation",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3810
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4900,
            "description": "Discussion and analysis of selected topics in economic theory and of current economic issues.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Seminar In Economics",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3811
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4940,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Readings In Economics",
            "prefix": "ECON",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3812
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4960,
            "description": "Selected topics in economic analysis and problems to meet the special needs of upper-division students in various curricula throughout the Institute. This allows students to pursue more in-depth work in their areas of study.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Topics In Economics",
            "prefix": "ECON",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3813
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4330,
            "description": "This course will examine a wide range of financial markets and institutions and the micro-and macroeconomic forces that relate to them. Topics include the use of derivative securities such as future, options, and swap agreements, and their roles in distributing financial risk. The course will be driven by textbook readings, supplemented by current news stories, articles from the financial press, and research articles.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Economics Of Financial Institutions & Markets",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3814
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4310,
            "description": "Market-based economies depend upon legal systems that establish and protect property rights. In this and many other instances the law is designed to encourage and support economic activity; in others it is designed to restrain certain types of otherwise rational economic behavior. This course will apply fundamental economic concepts, such as supply and demand, competition, monopoly, externalities, and Pareto efficiency to a range of legal topics, including contracts, torts, criminal, and intellectual property law to explain the economic motivation and consequences of the legal framework. For those students considering law school, this course offers an exposure to many of the legal concepts found in the first year law school curriculum.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Law & Economics",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3815
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4280,
            "description": "Examine advanced econometric and statistical methods for the analysis of high-dimensional data, otherwise known as “Big Data.” In this setting, detailed information for each unit of observation informs machine learning techniques such as classification and regression trees; random forests; penalized regressions; and boosted estimation. These prediction methods are then utilized to improve causal modeling, with applications in the study of healthcare demand and supply modeling, and behavior of consumers and businesses.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Econometric Methods–Big Data",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3816
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4430,
            "description": "Dynamic models of national and international economic growth are introduced and analyzed.  Technological innovation is central to growth, and models consider the endogenous determinants of technological innovation and diffusion.  National institutions that affect growth, such as law, education, and infrastructure, are considered. Variation in intellectual property rights across countries are examined, together with their effects on economic growth and development. Theories of growth are compared to empirical fact.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Economics Of Growth And Innovation",
            "prefix": "ECON",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3817
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 1050,
            "description": "A survey of visual arts from Paleolithic Era to today. Materials are presented in a form accessible to students without previous knowledge of Art History.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Arts History",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3818
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1030,
            "description": "Television is considered a defining social, political and cultural feature of consumer culture. Television is morphing into something more expansive and diverse. In this course, we will study the impact of television and learn to make it. Through hands-on experience, students produce and direct their own multi-camera projects. Students work on technical and creative aspects of production. Students learn to operate studio gear including green screen, live switcher, cameras, audio, teleprompter, lights, etc.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Behind The Television Screen",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3819
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1040,
            "description": "Documentary in the 21st Century: Identity Production is a production course investigating the course of documentary history leading to a focus on digital media representations today. This course will incorporate critical thinking with production.  With focus on aesthetic and formal considerations, students will be asked to produce a series of multimedia projects investigating their vision of themselves in the world.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Documentary In The 21St Century",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3820
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2040,
            "description": "Intermediate Digital Imaging is a hands-on studio course exploring the use of computer technologies in making visual art. A study of contemporary issues in digital media and photography facilitates individual innovation and experimentation. Digital imaging and input/output techniques are employed in terms of giving visual form to ideas and personal expression in private and public settings.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Intermediate Digital Imaging",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3821
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2060,
            "description": "2D Experimental Animation is an introduction to animation as an art form. Most of this course will be traditional assignments designed to encourage spontaneous creativity, explore animation concepts, and learn animation terminology. Assignments will build a solid foundation for entrance into 3D Animation. This course will also be a historical and theoretical investigation with screenings and readings followed with discussion.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "2D Experimental Animation",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3822
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2070,
            "description": "A studio arts course exploring the fundamental concepts, techniques, styles, and mechanics used in the creation of graphic narrative. Contents to be covered include the fundamentals of sequential art, the purposes and formats of storyboards, basic terminology and concepts used in storyboarding, and the applications of storyboard techniques. Key visual storytelling structures are explored for the following industry applications: comics, animated films, graphic novels, commercials, documentaries, live action feature films, and video gaming.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Graphic Storytelling",
            "prefix": "ARTS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3823
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2230,
            "description": "A foundational course in concepts and techniques in digital 3D, for animation, games, and digital art. This course focuses on methods and aesthetics in creating digital 3D objects, spaces, and characters, including modeling, texturing, and lighting, as preparation for further courses in the 3D Animation curriculum.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "3D Bootcamp",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3824
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4060,
            "description": "An introduction to the technical techniques and principles of computer animation with a focus on rigging, skinning, character fx, particle simulations, compositioning and rendering. Lectures, discussion, and exposure to contemporary work enable students to develop skills in this rapidly evolving field.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "3D Visual Effects",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3825
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4070,
            "description": "An intermediate hands-on studio course in 3D computer animation, acting, dialog, cinematography, and story building.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "3D Animation",
            "prefix": "ARTS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3826
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4090,
            "description": "This course is primarily concerned with learning how to build any interactive experience or artwork from concept to completion. It will introduce open-source, cross-platform programming libraries and tools used by artists and programmers to create interactive experiences and artworks for museum installations, festivals, VJ-ing, projection mapping, interactive experiences/artworks, and more. It will then start to address the questions: Is code an art form? What is interactive art? Is software art?",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Art, Code, & Interactivity",
            "prefix": "ARTS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3827
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4860,
            "description": "This upper level studio and seminar explores individual visual arts projects contributing to thesis or dissertation development. Topics in creative personal expression in imaging, installation, digital/traditional mixed media and emerging genres will be studied drawing from issues raised in class projects. Advanced studies may include high resolution digital photography, montage, archival printing, gesture drawing, painting, assemblage, processing, stencil art, projection, and evolving genres which lead to an independent final project and web portfolio.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Advanced Digital Imaging",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3828
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1110,
            "description": "This course focuses on the social and ecological aspects of humans in the natural world. It emphasizes critical thinking about where humans come from and where they are going as a species. The course draws on historical perspectives and addresses contemporary issues such as climate change, national energy resources, and the local foods movement. The course includes readings as well as student projects, field trips, guest lectures, and “ethnographic” assignments about this consumer society.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Nature & Society",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3829
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1240,
            "description": "Students in this course participate in a series of class debates, presenting and cross-examining the arguments of those who have a stake in various environmental controversies (about energy, toxic chemicals, consumption, etc.). Students also work in groups to design a proposal for a project to help solve an environmental problem. Throughout the course, students are encouraged to develop their own environmental values and ideas. This is a communication-intensive course.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Sustainability Debates",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3830
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1320,
            "description": "This course examines the emergence of environmental consciousness in the United States throughout the 20th century. Students in this course will study the original writings of some of the most important thinkers and activists in the history of environmentalism, examine the social contexts in which their ideas formed, and consider their relevance to contemporary sustainability issues.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "A Century Of Environmental Thought",
            "prefix": "IHSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3831
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1350,
            "description": "This course examines the interconnections between values and law, seeking to understand how these affect and are affected by science and technology by examining such topics as computers and privacy, medical malpractice, abortion, and other legal conflicts surrounding new reproductive technologies, problems of expert witnesses, sexual harassment, patent infringement, auto safety litigation, and siting of hazardous facilities, among others.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Law, Value, And Public Policy",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3832
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1720,
            "description": "Music and Nature explores the intersections between music and nature from a variety of perspectives. Music will be approached as artistic expression as well as a form of knowledge that can heighten our sensitivity and awareness of the environment and natural processes. Music and Nature incorporates reading and writing assignments, individual and group creative projects.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Music And Nature",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3833
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1966,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Music And Protest",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3834
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 19,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Designing Climate Justice",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3835
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4240,
            "description": "Eco Chic: Living Art is an upper level production and theory class about art, biology, and the study of life covering topics such as environmentalism, land art, food art, sustainable practices with art, body art, bio-art. Part lecture, part hands-on workshop, Eco Chic encourages students to redefine and experimentally express their relationships with the varied aspects of everyday living systems and manipulating life.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Eco-Chic:  Living Art",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3839
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4080,
            "description": "Through direct experience in the community, this course explores the complex roles and relationships of art, education, and technology. Students will develop a plan to work with a media arts center, community organization, or school; final teams will produce real-world arts and education projects that ultimately will be realized as significant additions to their professional portfolio. The projects can include a range from traditional arts practice to creative writing, creative IT models, to community art and activism.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Art, Community, And Technology",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3836
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4120,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Bio Punk",
            "prefix": "ARTS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3837
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4300,
            "description": "While concepts such as quality of life, environment, nature, global ecology, and the like figure heavily in contemporary discussions, they are seldom integrated into an environmental philosophy. The course tries to achieve this integration by understanding some of the religious, mythic-poetic, and scientific dimensions of the man-nature matrix. Some specific environmental problems are examined in order to illustrate the system of values implied by various solutions.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Environmental Philosophy",
            "prefix": "PHIL",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3840
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4500,
            "description": "This course involves a philosophical analysis of some of the basic moral issues raised by recent and anticipated developments in the areas of biology and medicine. The general question “What are moral problems, and how does one resolve them?” is examined in the context of concrete cases involving issues such as abortion, euthanasia, organ transplants, experimentation on human patients, cloning, genetic engineering, and behavior control and modification.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Bioethics",
            "prefix": "PHIL",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3841
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4140,
            "description": "Queer Ecologies is an undergraduate and graduate arts course that uses art to think about our eco-futures. We will look at the disruptive nature of Cartesian thinking and binary positioning in relation to sexuality and ecologies. The “queering” is a means to refuse this binary thinking and consider expansive interdisciplinary practices that have evolved from LGBTQ+ and feminist theory, decolonial thinking, extinction and death studies, environmental justice, critiques of science and big pharma, biopolitics, bioethics, biology, science fiction, aesthetics, art and play.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Queer Ecologies",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3838
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4250,
            "description": "This course explores historical perspectives on bioethics through concrete cases and practical problems faced in the design and execution of some of the highest profile biomedical research and most consequential clinical decisions of the twentieth century. Topics include vaccine development; human radiation experiments; new genetic and reproductive technologies; right-to-die, death-with-dignity, and physician-assisted suicide; human experimentation, including prisoners, the sick, and the disabled; neuroethics; animal research; and emergent topics such as stem cell research, prenatal diagnostics, and genetic testing. This is a communication-intensive course.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Bioethics",
            "prefix": "STSH",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3842
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4700,
            "description": "This is an introduction to environmental law and policy, with emphasis on the practical use and application of legal concepts. Students will work to develop critical thinking and advocacy skills. Professionals who work with environmental issues need to effectively argue for a position. Therefore, class participation plays a significant role in this course. Students should come to class prepared to discuss, debate, and (re)consider. Effectively advocating for one point of view requires an understanding of other perspectives. One must approach every issue with an open mind and a willingness to engage on a legal and policy level rather than from a personal or political perspective. This objective detachment is one of the hardest and most crucial skills students will work to learn. Over the course of the semester, the class will feature guest speakers (dates and identities TBA). Assigned readings for the guest speakers will replace those on the syllabus for that day. Depending on student progress and interests, the readings may change.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Environmental Law",
            "prefix": "STSH",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3843
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4720,
            "description": "What is consumer culture? What are its roots, its consequences, and alternatives? Documentaries and the research of anthropologists, historians, and religious scholars examine consumer culture in the U.S. and UK including recognition of the global locations in which consumer goods are made. Topics include buying and selling, shopping, retail, manufacture, material culture, pricing, consumer goods, disposal, kinship, identity, exchange, and advertising, with attention paid to differences in race, class, and gender.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Consumer Culture",
            "prefix": "STSH",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3844
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4720,
            "description": "What is consumer culture? What are its roots, its consequences, and alternatives? Documentaries and the research of anthropologists, historians, and religious scholars examine consumer culture in the United States and the United Kingdom including recognition of the global locations in which our consumer goods are made. Topics include buying and selling, shopping, retail, manufacture, material culture, pricing, consumer goods, disposal, kinship, identity, exchange, and advertising, with attention paid to differences in race, class, and gender.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Consumer Culture",
            "prefix": "STSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3845
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2300,
            "description": "Society and the natural environment are crucially linked in a number of ways. Environmental problems such as pollution and natural resource depletion are not only problems for society, affecting the way people live their lives; they are also problems of society—the result of patterns of social organization and social practices. In this course, students will explore these society/environment interactions at various levels, from the local to the global, using the concepts and insights of environmental sociology. Environmental sociologists aim to understand the social origins of environmental problems and propose workable solutions to them. By showing how social interaction, institutions, and beliefs shape human behavior, environmental sociology provides a useful complement to the natural sciences in the analysis of the environmental problems faced today.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Environment And Society",
            "prefix": "STSH",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3846
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4280,
            "description": "This course examines needs for and challenges of delivering environmental education in different settings. Students critically review existing environmental education curricula then design and deliver their own to K-12 students. The history of public education in the United States, factors shaping contemporary education, various approaches to environmental education, and the complex challenge of interdisciplinary curriculum design are examined. Students in the course develop and demonstrate their own educational and environmental values.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Sustainability Education",
            "prefix": "STSH",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3847
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4320,
            "description": "What does resilience really mean and why does it matter? This course will unpack the multiple meanings that make up “resilience” and students will learn about its relevance to this society. Upon entering the Anthropocene, climate change will ensure that sporadic, disruptive change will be the norm. Disruptions will come on numerous levels and at a variety of scales. Is resilience about strengthening defenses so that “resilient” landscapes, infrastructure, and organizations can bounce back or is it more? Students will be asked to contribute to a collective understanding of how systems thinking and resilience thinking can help strengthen the ability to adapt and transform when humans are faced with social and ecological change. Can resilience planning help with the difficult conversations that are needed to balance the socio-economic and ecological trade-offs that the Anthropocene demands?",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Resilience Planning",
            "prefix": "STSH",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3848
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1150,
            "description": "The ability to sequence complete genomes has had a revolutionary impact on medicine, agriculture, our environment and the very idea of what it means to be “human”. Genomic medicine will impact virtually everyone in the United States in the coming decades. As informed citizens, it is important that we have a working understanding of genomics and its implications for individuals and for society at large. These conversations are critical to ensure the ethical and accessible use of genomics and to allow us to make informed decisions on both personal and public-policy levels. This course will explore the science, ethics, and history of genetic research and genomics, using case studies to illustrate and personalize the issues at hand.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "The Genome And You",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3849
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1160,
            "description": "This course will provide a comprehensive introduction to the field of ethics of scientific research.  Why do seemingly good people do bad things?  What is science?  What is “bad” science? What constitutes scientific misconduct?  We will explore the answers to these questions through fields such as Sociology, History, Philosophy, Psychology etc.  Using evidence from contemporary and historical scientific experiments we will try to understand why researchers might commit scientific misconduct such as fabrication of results, plagiarism, and falsification of data.  A brief overview some philosophical theories of ethics and several professional/scientific codes of ethics will be covered.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Science And Scientific Misconduct",
            "prefix": "IHSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3850
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1420,
            "description": "This course will examine and offer possible solutions to current and emerging global health issues. Our emphasis will be on social and health problems in low income and middle-income countries in contrast to the health care needs in high-income countries. We will look at selective chronic and acute illnesses, ethnomedical practices, medical ethics, and environmental racism when dealing with low-income and developing countries.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Global Health Challenges",
            "prefix": "IHSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3851
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 19,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Philosophy, Technology, And The Human Future",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3852
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1110,
            "description": "An introduction to the social, historical, and ethical influences on modern science and technology. Cases include development of the atomic bomb, mechanization of the workplace, Apollo space program, and others. Readings are drawn from history, fiction, and social sciences; films and documentary videos highlight questions about the application of scientific knowledge to human affairs. The class is designed to give students freedom to develop and express their own ideas.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Science, Technology, And Society",
            "prefix": "STSH",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3853
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1110,
            "description": "An introduction to the social, historical, and ethical influences on modern science and technology. Cases include development of the atomic bomb, mechanization of the workplace, Apollo space program, and others. Readings are drawn from history, fiction, and social sciences; films and documentary videos highlight questions about the application of scientific knowledge to human affairs. The class is designed to give students freedom to develop and express their own ideas.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Science, Technology, And Society",
            "prefix": "STSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3854
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4560,
            "description": "This course explores the history, methods, and goals of hackers with special attention paid to their role in social movements. It broadly interprets the term “hacktivism” to include computer hacking, media hacking and “reality hacking” in the service of social change. Students will gain an understanding of how and why hackers have emerged as a major social force.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Hactivism",
            "prefix": "ARTS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3855
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4340,
            "description": "While concepts such as quality of life, environment, nature, global ecology, and the like figure heavily in contemporary discussions, they are seldom integrated into an environmental philosophy. The course tries to achieve this integration by understanding some of the religious, mythic-poetic, and scientific dimensions of the man-nature matrix. Some specific environmental problems are examined in order to illustrate the system of values implied by various solutions.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Environmental Philosophy",
            "prefix": "STSH",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3856
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2700,
            "description": "There ought to be a law…”  Law shapes people’s lives in countless ways; it is everywhere. Law permits, prohibits, enables, legitimizes, protects, and prosecutes. Law is more than the written word, the “black letter law.” People make the law—judges, attorneys, police officers, legislators, defendants, and plaintiffs. This course will explore the law’s social, political, cultural, and historical aspects. Using an interdisciplinary approach, the course will examine how social theorists conceptualize and explain the relationship between law and society. Students will be exposed to the theoretical frameworks that are used to examine how the law shapes society, and society shapes the law, and develop an understanding of the social processes that affect the legal system. The course will advance students’ capacity to think critically and communicate effectively about themes, concepts, and arguments surrounding the law and learn what law is; where it comes from; who creates it; and what roles it plays in shaping society.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Law And Society",
            "prefix": "STSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3857
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4210,
            "description": "This course explores the ethical issues that engineers encounter in their professional practice. It also examines social values and law and policy issues that shape engineering and technological decision making. Using case studies, professional codes of conduct, and scholarly literature, the course examines the responsibilities of engineers in relation to their employers, clients, co-professionals, and their responsibility for public safety and welfare. Topics include the history of engineering, professionalism vs. the demands of business, engineering vs. management decision making, whistle-blowing, proprietary rights and trade secrecy, and conflicts of interest.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Engineering Ethics",
            "prefix": "STSH",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3858
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4400,
            "description": "This course is a sociological and anthropological exploration of health and illness. By the end of the course, students will have an overall picture of health fields, problems faced by patients and caregivers, medicine and health in non-Western societies, and the social shaping of disease and therapeutic choices.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Medicine, Culture, And Society",
            "prefix": "STSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3859
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4240,
            "description": "A critical examination of traditional and contemporary works in ethical theory by considering what these theories have to say about how people should live, what rights and obligations they have, what things are intrinsically valuable. Typically, this includes such topics as ethical and cultural relativism, egoism, freedom, and responsibility. Often the focus will be on contemporary issues such as war, abortion, equality, or punishment.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Ethics",
            "prefix": "PHIL",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3860
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1510,
            "description": "This course examines how culture and society shape war, and inversely, how war shapes culture and society. It views war through the lens of social sciences with case studies ranging from the role of war in non-western societies to the ways in which war has affected American culture. Some of the issues covered in the course include the study of different types of war, the relations between war and the nation-state, between weapons technology and culture, the notions of pacification and nation-building, and the role of rituals in the military institution.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "War And Society",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3861
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1470,
            "description": "This course investigates the relationship between warfare and technology in historical and present-day settings. It will also cover how military technology might evolve in the future. In addition to considering the ways in which technology has changed the practices of warfare, the course will examine the ethical, political, social and economic problems and developments that have arisen from the intersection of military and technological change.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "War And Technology",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3862
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1253,
            "description": "The Aristotelian dictum that we are rational animals is under severe attack these days. In fact, the previous sentence may seriously understate the situation: the dictum is perhaps outright rejected by many, if not most. From psychologists of reasoning and decision-making to behavioral economists to the “new atheists” (all groups whose message we will consider in this class), the onslaught is firmly underway, and fierce.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Are Humans Rational?",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3863
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1180,
            "description": "Listening to each other, ourselves, and our surroundings can be a transformative experience that enhances well-being. In this course, a heightened awareness to sound will be developed through experiential exercises, creative projects, collaborations, readings, lectures, and discussion. The course introduces “Deep Listening,” a practice developed by pioneer composer and humanitarian Pauline Oliveros to enhance and expand listening abilities and to encourage creative work.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "The Art Of Listening",
            "prefix": "IHSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3864
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2520,
            "description": "This course introduces students to basic topics in communication theory and research. It includes topics in interpersonal, group, organizational, mediated, and mass communication. Students will study and apply theories to real world situations and events and explore the social and cultural impact of new media technology.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Communication Theory And Practice",
            "prefix": "COMM",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3865
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2100,
            "description": "This course provides tools for the identification, analysis, and evaluation of the various patterns of reasoning as they occur in the real world. Patterns of reasoning include deductive reasoning, inductive reasoning, scientific reasoning, statistical reasoning, and causal reasoning. The course also covers some basic psychology and sociology of reasoning and belief and concludes with a critical discussion of science and the scientific method.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Critical Thinking",
            "prefix": "PHIL",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3866
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2100,
            "description": "This course provides tools for the identification, analysis, and evaluation of the various patterns of reasoning as they occur in the real world. Patterns of reasoning include deductive reasoning, inductive reasoning, scientific reasoning, statistical reasoning, and causal reasoning. The course also covers some basic psychology and sociology of reasoning and belief and concludes with a critical discussion of science and the scientific method.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Critical Thinking",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3867
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2140,
            "description": "Introduction to first-order logic as a tool to be used in engineering, computer science, philosophy, etc., and as procedural knowledge helpful in puzzle-solving environments (e.g., standardized tests). A hands-on laboratory component is included.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Introduction To Logic",
            "prefix": "PHIL",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3868
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4370,
            "description": "The focus of this course is on the flow of information from sensory input to retrieval from long-term memory. Within this framework, topics such as mnemonics, pattern recognition, attention, computer simulation, reasoning, and the relationship between culture and thought are discussed.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Cognitive Psychology",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3869
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4530,
            "description": "What is science, what is technology, and how have these two fields of inquiry evolved over time? This course examines these questions by studying the history of various scientific fields and technologies. In addition to tracing the historical evolution of the topics studied, the course will consider how social, political, economic and cultural factors helped to shape – and were in turn shaped by – advances in science and technology. The course will also reflect upon the relationship between science and technology on the one hand, and “progress” on the other.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "History Of Science And Technology",
            "prefix": "STSH",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3870
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2340,
            "description": "This course focuses on developing public speaking skills and critical listening abilities. Guided by rhetorical theory, theories of persuasion, and argumentation theory, students prepare several oral presentations, engage in extemporaneous speaking exercises, and criticize other performances.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Speech Communication",
            "prefix": "WRIT",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3871
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4550,
            "description": "Make things happen: start a business, raise funds, solicit work, support research, win a place on a conference program, take initiative, change the way things are done around here. This course will teach students how to write proposals that persuade. Students will learn to turn situations into occasions for proposing, write a variety of proposals, locate Request for Proposals, develop a work plan for feasible projects that come in on-time and on-budget, use networks to strengthen proposals, detail a budget, and edit for clarity and grace.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Proposing And Persuading",
            "prefix": "WRIT",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3872
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1560,
            "description": "A survey of the historical origins and cultural impact of several mass media, including television, film, radio, the Internet, and print media. The course aims to increase media literacy through analysis of specific media products as well as discussion of broad topics such as: advertising and commercialization; politics and censorship; gender, race, and social identity.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Media & Society",
            "prefix": "IHSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3873
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1973,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "News Media, Culture & Politics",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3874
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1976,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Fiction: From Film To The Internet",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3875
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 19,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Documentary In The 21St Century",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3876
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 19,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Documentary:  Whose Narrative?",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3877
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 19,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "The American Dream",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3878
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 1110,
            "description": "An introduction to the major areas of philosophy (ethics, theory of knowledge, philosophy of religion, etc.) and to some of the main problems treated within these fields. Selections from contemporary as well as classical authors are studied and discussed. Students are encouraged to develop a disciplined approach to intellectual problems. Emphasis varies with the instructor.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Introduction To Philosophy",
            "prefix": "PHIL",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3879
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4040,
            "description": "This is a production course investigating non-traditional approaches to documentary or non-fiction film/video. Taking a broad look at what defines “documentary” media, this course will incorporate criticism with production. Students will produce a range of video works questioning conventional documentary styles, using radical and interventionist techniques. Students will study traditional documentary works including ethnographic films, cinema verité, propaganda films, “home movies,” reality TV, tabloid news, autobiographic and activist videos.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Rethinking Documentary: Video Production",
            "prefix": "ARTS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3880
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4640,
            "description": "Science Fictions is an advanced narrative video production and theory course. The class looks at thematic areas of science fiction, utopia and dystopia, paranormal, and speculative fiction. ‘Speculative fiction’ is a genre that looks at the real world and extends what is known about it, building on the ‘real.’ The class has two threads: to study narrative structure and create a series of sci-fi videos; to discuss and analyze mainstream and avant-garde science fiction films and themes from the early 1900s to the present.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Science Fictions",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3881
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2110,
            "description": "In this course students consider how different “screens,” from mobile apps to motion pictures, require different approaches to communication. Students learn to critically read, write, and create various genres of visual media, including educational, entertainment, experimental, informational, and commercial content for film, television, Internet, and mobile media. The course invites students to solve challenging communication problems, explore how media shape worldviews and identities, and reflect on how compelling stories bring about new ways of “seeing.”",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Writing For The Screen",
            "prefix": "COMM",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3882
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2440,
            "description": "Does documentary film depict reality or is it just another form of storytelling? This course takes a broad, historical look at documentary media, exposing students to a wide range of works that in some sense stand on claims to truth. Students are invited to develop a critical stance toward documentary modes of social representation, through viewing and analyzing colonial photography and cinema, ethnographic, propaganda, cinema verite, experimental, and even “fake” documentaries.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Documentary Film",
            "prefix": "COMM",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3883
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4530,
            "description": "This course considers the sociopolitical and ethical dimensions of reality television and post-factual media content. An analysis of a variety of “reality” and news formats allows students to understand the evolution, economics, and, above all, the cultural and political significance of modern media. Topics include: simulation; social representation; commercialization; social media; surveillance; nationalism; and globalization.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Reality Tv And Post-Factual Media",
            "prefix": "COMM",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3884
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4580,
            "description": "An examination of the cultural impact of advertising in various media: TV, radio, print, and the Web. How does advertising inform human experience and identity? How has it shaped the culture? Who pays for it and why? Note: This is not a How-To course. The focus is critical analysis, not acquiring skills for producing advertising.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Adverting And Culture",
            "prefix": "COMM",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3885
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4150,
            "description": "An exploration of the ongoing dialogue between science/technology and literature through the reading of landmark works about science and fictional works that describe scientific ideas and methods. Topics include artificial intelligence, genetic engineering, and cyborgs.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Science And Fiction",
            "prefix": "LITR",
            "spring": 0,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3886
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4130,
            "description": "How does science stimulate philosophical thinking and how has philosophy influenced science? This broad range of interaction is studied with special attention given to the concepts of theory, observation, and scientific method. Special attention is given to issues basic to psychology, in particular, reductionism, behaviorism, functionalism, and cognitivism.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Philosophy Of Science",
            "prefix": "PHIL",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3887
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4430,
            "description": "This course teaches basic historical, anthropological, and sociological concepts that can be used to make sense of a wide variety of contemporary phenomena students encounter in everyday life. The focus is on analyzing how licit and illicit drugs serve as “technologies” within specific social contexts or subcultures; what drug policy reveals about social, political, and economic organization; and the impacts of biomedical knowledge and practice on specific population groups. The course focuses on the representation of drug use and drug users in popular culture, science and medicine, and history and the social sciences.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Drugs In History",
            "prefix": "STSH",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3888
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4430,
            "description": "This course teaches basic historical, anthropological, and sociological concepts that can be used to make sense of a wide variety of contemporary phenomena students encounter in everyday life. The focus is on analyzing how licit and illicit drugs serve as “technologies” within specific social contexts or subcultures; what drug policy reveals about social, political, and economic organization; and the impacts of biomedical knowledge and practice on specific population groups. The course focuses on the representation of drug use and drug users in popular culture, science and medicine, and history and the social sciences.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Drugs In History",
            "prefix": "STSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3889
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4570,
            "description": "This class studies central questions and theories in contemporary political thought. At a time in which conventional understandings of the structures, dynamics, and outcomes of political life no longer offer reliable guidance for one’s thinking, the course will examine a number of alternative modes of understanding and argument.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Contemporary Political Thought",
            "prefix": "STSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3890
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4590,
            "description": "This class studies the workings of major institutions and practices in American life during a period in which key parts of our society seem dysfunctional, having lost their integrity, ability to solve problems, and willingness to imagine any positive future. How did this happen? Why does it continue? What might be done about it? Through a careful reading of texts in political analysis and social criticism, students explore some significant issues in modern society.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "American Politics In Crisis",
            "prefix": "STSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3891
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2320,
            "description": "This is a workshop course in which novice and more experienced student writers produce creative nonfiction-prose that aims to be both factually accurate and compelling literature; students must have a good command of written English and grammar. Focus may vary by semester among memoir, lyric and personal essays, plotted narrative, oral history, and nature writing. For models, students study classic and contemporary accomplished writers who connect the self to the larger world. Class work centers on drafting and revising essays with regular peer workshops.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Creative Writing: Non-Fiction",
            "prefix": "WRIT",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3892
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2330,
            "description": "A workshop course in reading and writing varied forms of short narrative and non-narrative prose fiction; students must have a good command of written English and grammar. This course will focus on reading and analyzing exemplary short fiction and writing and revising original work. Students learn to develop plot, character, setting, point of view, style, and theme, and use description effectively to invent and shape narrative strategies. Peer reading and writing groups offer opportunities for shared response and critique.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Creative Writing: The Short Story",
            "prefix": "WRIT",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3893
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 1410,
            "description": "This course assumes no previous knowledge of the subject. The course is designed to provide students with fundamental skills in listening, speaking, reading, and writing Mandarin Chinese. Oral and aural skills will be emphasized. Background on Chinese culture will be introduced as an element of the course. For entry level, non-native speakers only.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Chinese I",
            "prefix": "LANG",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3894
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2410,
            "description": "This is a continuation of Chinese I, a course for the standard modern Chinese language (Mandarin). Students learn more Chinese characters and words, reach a total of nearly 500 characters and 650 words, and use more complicated grammatical structures, including some compliment phrases and topic-comment sentences. In sum, students will learn more in all four aspects—listening, speaking, reading, and writing—presented in Chinese I.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Chinese Ii",
            "prefix": "LANG",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3895
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2940,
            "description": "Readings and projects adapted to the needs of individual students.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Language Studies",
            "prefix": "LANG",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3896
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2960,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Topics In Language",
            "prefix": "LANG",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3897
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4940,
            "description": "Readings and projects adapted to the needs of individual students.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Language Studies",
            "prefix": "LANG",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3898
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4960,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Topics In Language",
            "prefix": "LANG",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3899
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1600,
            "description": "This course surveys 5000 years of game history, from ancient Sumer/Sumerian to the latest next-generation consoles and MMOGs. In parallel with this historical tour, several major theories will be examined about the nature of play and the nature of games. Along the way, it will also look at how games and play influence the cultures they are found in, and how culture in turn influences how people structure their leisure time will also be considered.",
            "fall": 1,
            "major_restrictive": 1,
            "name": "History And Culture Of Games",
            "prefix": "GSAS",
            "spring": 1,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3900
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2510,
            "description": "This course looks at the mathematics of game theory from a psychological perspective and serves as a primer in video game design. The psychology of players and designers are discussed, as well as the cognitive processes that people use when solving game-related puzzles. Additional topics include logic, human frailty, role playing, artificial intelligence, kinesics, theater, and human-computer interaction.",
            "fall": 1,
            "major_restrictive": 1,
            "name": "Introduction To Game Design",
            "prefix": "GSAS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3901
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2520,
            "description": "This course is designed to provide an overview of the art of effective story development. Students will come away with a heightened awareness of the structures and principles that master storytellers apply to their craft in games and other popular media. It is intended for all GSAS majors and other interested students, as well as the prerequisite for the GSAS concentration in Writing.",
            "fall": 1,
            "major_restrictive": 1,
            "name": "Introduction To Game Storytelling",
            "prefix": "GSAS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3902
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2540,
            "description": "This hands-on class introduces many fundamental concepts in game development. Students will learn to program multiple video games. Topics include render loops, rigid body dynamics, interfaces, event and messaging systems, and co-routines.",
            "fall": 1,
            "major_restrictive": 1,
            "name": "Introduction To Game Programming",
            "prefix": "GSAS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3903
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1666,
            "description": "This course explores the role of religion in different cultures and in the everyday lives of people around the world. It will introduce students to key concepts, themes, and debates in social science. The role of religion and rituals will be examined through classic texts in anthropology, sociology, political science, and in ethnographic cases relating to different types of societies, from traditional to modern American cultures. It will begin with some basic theoretical issues before discussing contemporary issues such as the relations between nation and religion, violence and religion, climate change and religion, and “magical thinking” in technology and science.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Religion In A Global World",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3904
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1710,
            "description": "What makes music popular? This course examines popular music in society, considering the ways in which it may express identities, motivate political movements, and function within various economic and technological environments. Lectures are supplemented by listening assignments, both to recordings and live performances.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Popular Music And Society",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3905
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1968,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Songs Of Identity",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3906
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 19,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Revolutions In Comparative Perspective",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3907
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2120,
            "description": "This course offers an introduction to theories and methods used to study language in its real time contexts. It begins by exploring the structure of sounds and words. The course moves on to investigate how language variation at those structural levels bleeds into social life – including the cultural and socio-historical production of identities, ideologies, and inequalities. The “exercise” component of this course provides a hands-on opportunity for engaging with the topics explored in course readings and lectures. Completing exercises will offer practice in, for example, using the International Phonetic Alphabet, transcribing and analyzing natural speech, and using various theoretical offerings to examine how social perspectives and attitudes impact both the use and interpretation of linguistic forms.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Language In Real Time",
            "prefix": "COMM",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3908
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4550,
            "description": "How are religious fundamentalists using new media? Can religious conversion take place in a theme park? How are religious “crossover” films transforming political and popular cultural landscapes? This course maps the complex intersections of religion, culture, and media in the global transformations of religious traditions and explores, through a media frame, “the return of religion” within the secular consensus of modernity.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Religion In Media",
            "prefix": "COMM",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3909
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4620,
            "description": "This course examines the role that language plays in the production of social identities and cultural assumptions about the world. Course topics include: language and worldview; linguistic contact and change, language ideology and nationalism, religious language, “politically correct” speech, and the key role that language plays in structuring race, gender and class-based systems of social inequality. Guest lectures from the Languages faculty.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Language And Culture",
            "prefix": "COMM",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3910
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2770,
            "description": "Women Writers examines creative works of literature produced by women of different times, such as novels, poetry, performance art, and graphic novels. These diverse works explore such topics as personal identity, love and sexuality, trauma and memory, and cultural difference, which are complicated by different historical attitudes towards gender, race, class, and religion. Discussion and viewing of films and visual art, as well as critical readings, will deepen the course’s focus on literature.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Women Writers",
            "prefix": "LITR",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3911
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2510,
            "description": "An introduction to human societies and cultures in comparative perspective, from tribal to complex societies. Topics include language and communication, technological adaptation, gender and sexuality, the global flows of people and commodities, and the rituals and beliefs through which people make meaning of the world.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Cultural Anthropology",
            "prefix": "STSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3912
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2520,
            "description": "A study of the principles and concepts of sociology and their application to the study of society and self. Students are introduced to the scope, materials, and methods of sociology. The issues and problems to be studied come from basic social institutions such as the family, science, and religion. Other topics may include love, crime, political economy, power, population growth, social class, and minority and ethnic relations.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Sociology",
            "prefix": "STSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3913
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4560,
            "description": "“Sex” is the biological distinction between being male and female. “Gender” is the social construction of masculinity and femininity. The purpose of this course is to explore if, and if so, how, science and technology reciprocally contribute to and are shaped by gender ideals and images. Gender is used as a tool for critical thinking about such topics as studies of sex differences, women in science and engineering, the environment, and war and peace.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Gender, Science, And Technology",
            "prefix": "STSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3914
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2660,
            "description": "This course introduces students to the practice of graphic design with a variety of hands-on projects. Studies include the principles and theories of 2D design and the integration of form, color, type, image, and content. Students will develop a heightened visual awareness and an understanding of how design influences meaning. The course emphasizes strategic and critical thinking in the solving of graphic design problems for the purposes of professional communication across a range of media platforms.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Introduction To Graphics",
            "prefix": "COMM",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3915
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4460,
            "description": "This course introduces students to the theoretical and practical use of graphics as a form of visual communication. Discussions include topics such as the psychology of visual perception, design theory, creative process, formatted text, and graphics. Students have an opportunity to put theory into practice using computer graphics.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Visual Design",
            "prefix": "COMM",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3916
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4690,
            "description": "This course focuses on the design theory and research behind effective interface design for hypermedia programs (multimedia computer programs with interactive inks). These interactive programs are the standard form of communication on the WWW, CDs, and DVDs. Students apply theory and research by designing and developing an interactive multimedia program (for WWW or CD).",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Interface Design",
            "prefix": "COMM",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3917
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4880,
            "description": "The course covers interactive, multimedia interface design (for Web sites and apps) for data visualization or other forms of interactive information design. Innovative designs that explore new directions in interactive data design are highlighted. Topics include multisensory information design using graphics, sound, touch, and large-scale data projection. Interface design topics include user-centered design, information architecture, rapid prototyping, cross-cultural design, and intellectual property. Students may choose the applications they want to design for the class project.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Interactive Data Visualization",
            "prefix": "COMM",
            "spring": 0,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3918
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "2D Motion Graphics",
            "prefix": "COMM",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3919
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 960,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Color Theory",
            "prefix": "COMM",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3920
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 1110,
            "description": "This course will help you experience the power of language and learn how to develop that power as you become more aware of your communicative choices. You will write for several genres, both formal and informal, creating each piece for a specific audience and purpose. You will learn to communicate effectively—orally, visually, and in writing—in a wide range of situations that will be crucial to success in your academic and professional careers.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Writing In Context",
            "prefix": "WRIT",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3921
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1410,
            "description": "This course details the scientific and social history of genetics, from Darwin and Mendel to the Human Genome Project. Special focus areas include: plant and animal breeding in the early twentieth century; eugenics movements in the U.S. and elsewhere; bacterial and fruit fly genetics; the development of molecular biology; the invention of recombinant-DNA technologies; the emergence of the biotechnology industry; the sociobiology controversies; genetics and evolutionary theory; and the Human Genome Project and contemporary genomics.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Century Of The Gene",
            "prefix": "IHSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3922
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1500,
            "description": "This course explores the historical development of modern international human rights through the lens of American foreign policy.  Through lecture and discussion of the assigned readings, this course will guide students in critical analysis of the narratives and national myths surrounding human rights in the history of the United States and the world.  Major themes include the origins of human rights, human rights abuses, the human rights regime, human rights institutions, and problems of enforcement.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Human Rights In History",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3923
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1570,
            "description": "This course investigates the relationship between warfare and technology in historical and present-day settings. It will also cover how military technology might evolve in the future. In addition to considering the ways in which technology has changed the practices of warfare, the course will examine the ethical, political, social and economic problems and developments that have arisen from the intersection of military and technological change.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "War And Technology",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3924
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 19,
            "description": "Documentary in the 21st Century: Identity Production is a production course investigating the course of documentary history leading to a focus on digital media representations today. This course will incorporate critical thinking with production.  With focus on aesthetic and formal considerations, students will be asked to produce a series of multimedia projects investigating their vision of themselves in the world.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Documentary In The 21St",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3925
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2500,
            "description": "This course surveys the history of the United States from the colonial era through the present. The course introduces major themes and tensions in United States politics, society, and culture with a focus on environmental factors. Topics will include encounters between American Indians and colonial peoples, independence,  the formation of the American government, slavery, immigration, citizenship, rights, social movements, colonialism, war, and the changing identity of the United States in the world.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "American History",
            "prefix": "STSH",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3926
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4420,
            "description": "This seminar surveys the history of medicine through discussion and analysis of secondary literature exploring central and key themes from the age of the Enlightenment up through recent history. Topics will include the history of the profession and practice of medicine, public health, disease, historical memory, education, the state, policy, institutions, and race, class, and gender in the history of medicine.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "History Of Medicine",
            "prefix": "STSH",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3927
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4440,
            "description": "This seminar surveys the history of mental health through discussion and analysis of secondary literature that explores central and key themes from the late eighteenth century up through recent history. Topics will include the history of mental health institutions and professions, the classification, diagnosis and treatment of mental illness, public health and policy, historical memory, the I.Q. controversy, the state, and race, class, and gender in the history of mental health.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "History Of Mental Health",
            "prefix": "STSH",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3928
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4510,
            "description": "Discusses the growth of American technology and its place within the framework of American history as well as the interrelationship of American and foreign technological developments. This course stresses the cultural contexts of technological change. Topics covered include the Erie Canal, the American system of manufacturing, railroads, emergence of engineering professions, corporate R&D, household technology, the technology of modern warfare, and the electronics revolution.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "History Of American Technology",
            "prefix": "STSH",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3929
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4530,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Global History Of Science And Technology",
            "prefix": "STSH",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3930
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4000,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Science And Technology Elective",
            "prefix": "STSH",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3931
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1220,
            "description": "This course is designed to introduce a wide variety of concepts and applications in the broad subject of economics, economics being the study of people’s choices. Traditionally, these choices have been framed as how to best employ scarce resources to produce goods and services and distribute them for consumption. To describe these choices the cause will introduce the concepts of opportunity cost, demand and supply theory, and market structures. It will consider the role of government in making resource allocation choices. Students will also study important macroeconomic data such as gross domestic product, economic growth rates, inflation, and unemployment. Additionally, studied will be the role of money and banking in the economy and short-run events such as recessions and expansions. Overall, the course will provide the student with an encompassing view of how economic principles and concepts relate to the broader economy and society.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "It And Society",
            "prefix": "IHSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3932
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1220,
            "description": "This course is designed to introduce a wide variety of concepts and applications in the broad subject of economics, economics being the study of people’s choices. Traditionally, these choices have been framed as how to best employ scarce resources to produce goods and services and distribute them for consumption. To describe these choices the cause will introduce the concepts of opportunity cost, demand and supply theory, and market structures. It will consider the role of government in making resource allocation choices. Students will also study important macroeconomic data such as gross domestic product, economic growth rates, inflation, and unemployment. Additionally, studied will be the role of money and banking in the economy and short-run events such as recessions and expansions. Overall, the course will provide the student with an encompassing view of how economic principles and concepts relate to the broader economy and society.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "It And Society",
            "prefix": "ITWS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3933
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2210,
            "description": "An introduction to the current theories, methods, and issues in human-computer interaction. Theory and research along with practical application are discussed within the context of organizational impact. The course provides the knowledge of HCI systems and research used for the implementation of safe, quick, and useable interactive technologies.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Intro To Hci",
            "prefix": "ITWS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3934
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2100,
            "description": "This course provides tools for the identification, analysis, and evaluation of the various patterns of reasoning as they occur in the real world. Patterns of reasoning include deductive reasoning, inductive reasoning, scientific reasoning, statistical reasoning, and causal reasoning. The course also covers some basic psychology and sociology of reasoning and belief and concludes with a critical discussion of science and the scientific method.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Critical Thinking",
            "prefix": "PHILL",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3935
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2140,
            "description": "Introduction to first-order logic as a tool to be used in engineering, computer science, philosophy, etc., and as procedural knowledge helpful in puzzle-solving environments (e.g., standardized tests). A hands-on laboratory component is included.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Introduction To Logic",
            "prefix": "PHILL",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3936
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 1200,
            "description": "This course embraces the science of psychology.  The aim is for students to learn how using the scientific method provides important insights about mind, brain, and behavior.  This course integrates research on neuroscience throughout all the standard topics in an introductory course in psychology.  The course presents advances across all subfields of psychology.  In addition to standard exams, there are online assignments for each chapter and online laboratory experiences.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "General Psychology",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3937
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2210,
            "description": "This course allows students to develop a critical understanding of the relationships between design, culture, and society. “Design” is defined broadly, touching on product/industrial design, urban design, and so-called alternative design approaches such as ecological and feminist design. The focus is on the role of design in contemporary culture with the goal of training students’ emerging appreciation of design as cultural practice on their professional work as engineers, architects, or business managers. This is a communication-intensive course.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Design, Culture, And Society",
            "prefix": "STSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3938
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2110,
            "description": "This course is designed to assist students in becoming more self-possessed and versatile writers. The course offers instruction in linguistic, rhetorical, and sociocultural concepts through its overarching focus on language: how it works, where it falls short, and how to harness it for specific purposes. Critical thinking and composing are conceptualized as processes, which includes the creation, development, organization, and revision of ideas and arguments. Students will complete a series of writing assignments in order to participate in contemporary debates occurring in both public and academic contexts.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Strategic Writing",
            "prefix": "WRIT",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3939
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4420,
            "description": "In this course, students will consider methods of gathering users’ requirements for product functions and information, ways to test products and information for usability and suitability, and procedures for incorporating the results learned through testing. Students will design and conduct usability tests on products, documents, and interfaces of interest.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Foundations Of Hci Usability",
            "prefix": "COMM",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3940
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4470,
            "description": "This course examines methods of graphic representation of data. Course work requires graphing of information derived from researched databases. Visual presentations of historic data will be examined to determine the most efficient way to represent complex information without distorting the data within. Information designers clarify these displays and enrich the understanding of the modern world.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Information Design",
            "prefix": "COMM",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3941
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4770,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "User Experience Design",
            "prefix": "COMM",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3942
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4780,
            "description": "This course introduces students to narrative theory and interactive narratives in a variety of genres such as oral story-telling, literature, poetry, film, artists’ books, historical narrative, hypertext fiction, Net Art, social media narratives, and computer games. Students will have the opportunity to design and develop an original interactive narrative.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Interactive Narrative",
            "prefix": "COMM",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3943
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4340,
            "description": "This course will explore how linguistics, the scientific study of the properties of human language and languages, can be applied to the development of intelligent agents that can fluently and meaningfully communicate with people in natural language. It will focus on linguistic phenomena that have so far been particularly resistant to effective machine processing, such as lexical ambiguity resolution, reference resolution, ellipsis, indirect speech acts, implicature, and non-literal language (e.g., metaphor and irony).",
            "fall": 0,
            "major_restrictive": 0,
            "name": "The Linguistics Of Computational Linguistics",
            "prefix": "COGS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3944
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4560,
            "description": "This course will explore the different strategies used by different languages to fulfill the same needs of human communication. A sampling of topics: quickly learning the basics of a new language using linguistic principles; cross-linguistic knowledge elicitation and engineering;  principles of generative grammar; space, time, agency, and other linguistic phenomena viewed cross-linguistically.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "A Cross-Linguistic Perspective",
            "prefix": "COGS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3945
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4780,
            "description": "This course will serve as a seminar for advanced students of linguistics. The material to be covered will be selected collaboratively by the instructor and each cohort of students. Students, who ideally will have taken at least two linguistics-oriented courses previously, will be guided in pursuing topics that they have found particularly compelling in previous courses.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Advanced Topics In Linguistics",
            "prefix": "COGS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3946
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 1000,
            "description": "No description",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Any 4 Credit Lang Of Any Level",
            "prefix": "LANG",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3947
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2340,
            "description": "This course offers a survey of scientific and applied approaches to the study of human language, highlighting the endlessly surprising nature of this sophisticated mode of communication. A sampling of the topics to be covered: phonology, morphology, syntax, semantics, lexicography, psycholinguistics, and historical linguistics. Lecture course.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Introduction To Linguistics",
            "prefix": "COGS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3948
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1976,
            "description": "A study of novels and short stories exploring the cultural contexts, social impacts, and ethical implications of film, television, robotics, simulations, info/bio technologies, the World Wide Web, Internet privacy, social media, mass advertising and entertainment, and fake news. Discussions, reading quizzes, written essays, and oral presentations based on the readings.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Fiction From Film To The Internet",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3949
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 1000,
            "description": "Any 1000-level literature elective",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Literature Elective",
            "prefix": "LITR",
            "spring": 1,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3950
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2000,
            "description": "Any 2000-level literature elective",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Literature Elective",
            "prefix": "LITR",
            "spring": 1,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3951
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2110,
            "description": "A study of major literary works that introduces students to basic ideas and terminology in literary criticism. Students learn to read and interpret a selection of novels, plays, poetry, or other forms of writing to be determined each semester by the instructor",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Intro To Literature",
            "prefix": "LITR",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3952
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2150,
            "description": "Students explore the philosophical, political, and artistic grounds from which modern and contemporary literature arises and develop their own creative capacities in a project related to the course readings.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Modern And Contemporary Literature",
            "prefix": "LITR",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3953
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4770,
            "description": "Women Writers examines creative works of literature produced by women of different times, such as novels, poetry, performance art, and graphic novels. These diverse works explore such topics as personal identity, love and sexuality, trauma and memory, and cultural difference, which are complicated by different historical attitudes towards gender, race, class, and religion. Discussion and viewing of films and visual art, as well as critical readings, will deepen the course’s focus on literature.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Women Writers",
            "prefix": "LITR",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3954
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4000,
            "description": "Any 4000-level literature elective",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Literature Elective",
            "prefix": "LITR",
            "spring": 1,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3955
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4230,
            "description": "A survey of major works by Irish authors writing in English, with a particular focus on the fiction and drama of the twentieth century. Authors will include: Oscar Wilde, Samuel Beckett, James Joyce, and W.B. Yeats.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Irish Literature",
            "prefix": "LITR",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3956
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 1000,
            "description": "Any 1000-level writing elective",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Writing Elective",
            "prefix": "WRIT",
            "spring": 1,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3957
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2000,
            "description": "Any 2000-level writing elective",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Writing Elective",
            "prefix": "WRIT",
            "spring": 1,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3958
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2310,
            "description": "This course is for students with little or no previous creative writing experience; students must have a good command of written English and grammar. Readings introduce traditional, modern, and post-modern poetic practice emphasizing imagery, figurative language, voice, line, and other formal aspects of poetry. Notebooks track development of student writing from reading exemplary texts to drafting revision of original poems. Writing workshop format includes analysis of published poems and peer discussion and critique of student work. For final projects, students create chapbooks, thematically sequenced poetry collections.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Creative Writing: Poetry",
            "prefix": "WRIT",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3959
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2310,
            "description": "This course, the first in a two-course sequence, provides an introduction to basic methods of behavioral and social science research, including experimental, quasi-experimental, and non-experimental research designs, psychometric considerations (e.g., reliability, validity, control, importance, levels of measurement), approaches to data collection and analysis, and communication of results. Students will demonstrate their understanding of the topics covered by writing a detailed research proposal formatted according to American Psychological Association (APA) guidelines.  Students will also gain experience in using a selection of parametric (e.g., correlation, simple and multiple regression, ANOVA) and non-parametric (e.g., Chi-square, Mann-Whitney U, Wilcoxon T, Kruskal-Wallis, Friedman’s ANOVA) statistical procedures. Data analysis will be carried out using R, an open-source programming language for statistical calculation and graphics, and R-Studio, an open-source integrated development environment for R.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Research Methods And Statistics I",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3960
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4350,
            "description": "This course will provide students with a systematic overview of practical and important mathematical tools and skills used in modern psychological sciences. Students completing the course will gain experience using mathematical tools drawn from diverse fields including calculus, linear algebra, probability theory,  nonlinear optimization, and other closely related disciplines. Rather than providing complete coverage of each field or focusing on formal proofs, the goal will be to provide students with the essential elements necessary to understand and use these tools to solve current and outstanding problems in the field today. This class will be hands-on, using examples drawn from across the cognitive sciences. Students will also gain experience implementing mathematical models in the R programming language.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Math Methods For Psychological Science",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3961
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4520,
            "description": "Study of global and national population characteristics, distribution, and trends. The course focuses on mortality, fertility, and migration along with the social issues or problems that are related to them.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Society By The Numbers",
            "prefix": "STSH",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3962
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4520,
            "description": "Study of global and national population characteristics, distribution, and trends. The course focuses on mortality, fertility, and migration along with the social issues or problems that are related to them.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Society By The Numbers",
            "prefix": "STSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3963
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4140,
            "description": "This course is a continuation of PHIL 2140, covering basic metatheory of logic (including formal syntax and semantics, model theory, and soundness and completeness of proof systems), applications of logic (including automated theorem proving, deductive problem solving, and the axiomatization of various branches of mathematics), and alternative systems of logic (including sequent systems, diagrammatic logic, and modal logic).",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Intermediate Logic",
            "prefix": "PHIL",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3964
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4420,
            "description": "A team-based, project-oriented, hands-on introduction to the great concepts and discoveries in logic and computability, including Turing Machines, first-order logic, the limitations of computing machines, Godel’s incompleteness results, and so forth. A hands-on laboratory component is included.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Computability And Logic",
            "prefix": "PHIL",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3965
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4960,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Inductive Logic",
            "prefix": "PHIL",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3966
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1560,
            "description": "A survey of the historical origins and cultural impact of several mass media, including television, film, radio, the Internet, and print media. The course aims to increase media literacy through analysis of specific media products as well as discussion of broad topics such as: advertising and commercialization; politics and censorship; gender, race, and social identity.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Media And Society",
            "prefix": "IHSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3967
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 19,
            "description": "Television is considered a defining social, political and cultural feature of consumer culture. Television is morphing into something more expansive and diverse. In this course, we will study the impact of television and learn to make it. Through hands-on experience, students produce and direct their own multi-camera projects. Students work on technical and creative aspects of production. Students learn to operate studio gear including green screen, live switcher, cameras, audio, teleprompter, lights, etc.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Behind The Television Screen",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3968
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 19,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Tech And The Top Ten",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3969
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2410,
            "description": "This course helps students understand the meaning and emotional complexity of visual images in their culture. Students examine photographic imagery through three perspectives. The first—formal—addresses the design components of the image, such as vantage point and contrast. The second—psychodynamic—concerns the emotional dynamics of viewing. The third—social political— explores photographs as instruments for preserving or challenging cultural values. No technical knowledge of photography is needed.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Perspectives On Photography",
            "prefix": "COMM",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3970
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "The Film Experience",
            "prefix": "COMM",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3971
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Critical Television",
            "prefix": "COMM",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3972
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4580,
            "description": "An examination of the cultural impact of advertising in various media: TV, radio, print, and the Web. How does advertising inform human experience and identity? How has it shaped the culture? Who pays for it and why? Note: This is not a How-To course. The focus is critical analysis, not acquiring skills for producing advertising.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Advertising And Culture",
            "prefix": "COMM",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3973
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4540,
            "description": "Humans inhabit a culture of visual images. Images bombard them on television, the Internet, and in films; they surround everyone as architecture and fashion; they provide essential resource data in science, engineering, and business. This course will help students better understand how images communicate information, arouse emotions, and shape values. Students will primarily do readings in cultural history/theory with some viewing of films.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Visual Culture",
            "prefix": "COMM",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3974
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4000,
            "description": "Description",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Cognitive Science Elective",
            "prefix": "COGS",
            "spring": 1,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3975
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4410,
            "description": "What are the processes that allow humans to detect information about their surroundings, recognize people and objects, and perceive depth and motion? This course will focus on the physiological and neural mechanisms underlying sensation (sight, hearing, and touch), the qualitative aspects of human perceptual experience, and how perception and action are interconnected. Color perception, object recognition, space and motion perception, and perception and action are all examined.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Sensation And Perception",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3976
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1010,
            "description": "This course, which is the prerequisite for further courses in music theory and in computer music, is an introduction to the materials of music. Using a variety of examples from classical, popular, and non-western music, the class will introduce concepts of melody, harmony, rhythm, and musical form. Students will use their laptop computers for aural skills practice, notation, and basic recording exercises. Although no musical experience is required for this course, sight singing is one of the important skills to be developed.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Exploring Music At Rensselaer",
            "prefix": "IHSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3977
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2180,
            "description": "Deep Listening is a practice developed by pioneering composer and humanitarian Pauline Oliveros to enhance and expand listening abilities and to encourage creativity. Students will develop a heightened awareness to sound and their sonic environment through experiential exercises, creative projects, collaborations, readings, lectures, and discussion. Musicians and non-musicians of all abilities and backgrounds are welcome!",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Deep Listening",
            "prefix": "ARTS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3978
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2500,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Histories Of Western Music",
            "prefix": "ARTS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3979
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2520,
            "description": "From “raves” to symphony hall, Indian film music to Tibetan chant, monster truck rallies to a mother’s lullaby, musical soundscapes surround us through all aspects of our daily lives. This course focuses on the study of music in or as culture. The exploration of music in human life will be comparative, using case studies from diverse world traditions and examining topics such as: ritual, media and technology, ethnicity/identity, music and dance, and musical transmission.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "World Music",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3980
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4180,
            "description": "This course continues the practice and study of Deep Listening beyond the foundational course “Deep Listening.” Topics include a wide range of investigations, research, and creativity in Deep Listening.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Topics In Deep Listening",
            "prefix": "ARTS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3981
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4700,
            "description": "This course approaches the modern digital studio as a compositional environment for the development of the student’s original creative projects. Engineering techniques will be explored through musical examples and hands-on projects.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Sound Recording & Production Ii",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3982
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 1000,
            "description": "Any 1000-level philosophy elective",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Philosophy Elective",
            "prefix": "PHIL",
            "spring": 1,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3983
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1165,
            "description": "This course invites you into the world of philosophical ideas and reasoning –to join a great conversation that has unfolded since Socrates exhorted people to lead an examined life 2,400 years ago in Ancient Greece. We will explore such issues as whether some ways of acting and living are morally better than others, the relationship that exists between mind and body, and whether philosophy has anything to contribute to ongoing discussions about the existence and nature of God. This course will include both frequent discussion and written assignments and will aim to help you develop your skills in each of these modes of communication. This course is communication intensive.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Great Ideas In Philosophy",
            "prefix": "IHSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3984
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1130,
            "description": "This course explores the philosophical and ethical implications of technological developments that promise to shape ‒ and perhaps to jeopardize ‒ human life and society in the 21st Century: Artificial Intelligence. Robots as social companions.  Robots in military and medical settings. Cloning. Genetic modification and technological implants for superhuman abilities. Students will improve their insight as well as their critical reasoning skills as we examine, analyze, and evaluate such controversial topics through the lens of philosophical reasoning. Throughout the course we will ask what sort of beings do we want to be and what sort of society do we want to have.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Philosophy, Technology, And The Human Future",
            "prefix": "IHSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3985
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2400,
            "description": "This course addresses such issues as: Are species real entities in the world or just human constructs? Are biological phenomena reducible to physical processes or do irreducible biological features exist? What is the relationship between microevolution and macroevolution? Does sociobiology have something to contribute to understanding of ethics? To what extent are the structures of the human mind products of evolution?",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Philosophy Of Biology",
            "prefix": "PHIL",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3986
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2000,
            "description": "Any 2000-level philosophy elective",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Philosophy Elective",
            "prefix": "PHIL",
            "spring": 1,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3987
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4480,
            "description": "Daydreams about some tropical paradise … the smell of freshly baked bread … the flash of anger experienced when one person cuts another off … the vision of an albino squirrel on the campus green … Humans take all of these to involve activities or states of consciousness. But what is this consciousness with which they claim to be so intimately familiar? What are its metaphysical implications, and can people reconcile those implications with current scientific understanding of the world?",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Metaphysics And Consciousness",
            "prefix": "PHIL",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3988
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4000,
            "description": "Any 4000-level philosophy elective",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Philosophy Elective",
            "prefix": "PHIL",
            "spring": 1,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3989
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2300,
            "description": "Society and the natural environment are crucially linked in a number of ways. Environmental problems such as pollution and natural resource depletion are not only problems for society, affecting the way people live their lives; they are also problems of society—the result of patterns of social organization and social practices. In this course, students will explore these society/environment interactions at various levels, from the local to the global, using the concepts and insights of environmental sociology. Environmental sociologists aim to understand the social origins of environmental problems and propose workable solutions to them. By showing how social interaction, institutions, and beliefs shape human behavior, environmental sociology provides a useful complement to the natural sciences in the analysis of the environmental problems faced today.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Environment And Society",
            "prefix": "STSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3990
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4000,
            "description": "Any 4000-level Science, Technology, and Society elective",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Science, Technology, And Society Elective",
            "prefix": "STSH",
            "spring": 1,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3991
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4000,
            "description": "Any 4000-level Science, Technology, and Society elective",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Science, Technology, And Society Elective",
            "prefix": "STSS",
            "spring": 1,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3992
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 1000,
            "description": "Any 1000-level strategic communication elective",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Communication Elective",
            "prefix": "COMM",
            "spring": 1,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3993
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2000,
            "description": "Any 2000-level strategic communication elective",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Communication Elective",
            "prefix": "COMM",
            "spring": 1,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3994
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 19,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Writing And Society",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3995
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4000,
            "description": "Any 2000-level writing elective",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Writing Elective",
            "prefix": "WRIT",
            "spring": 1,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3996
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 1200,
            "description": "An introductory course in drawing designed to develop seeing ability and means of expressing visual ideas through graphic skills. The course consists of exercises in drawing from observation and studies from the history of art.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Basic Drawing",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3997
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 1000,
            "description": "Any 1000-level art elective",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Arts Elective",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 1
        },
        "model": "database.course",
        "pk": 3998
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2200,
            "description": "Intermediate Drawing focuses on the exploration of the possibilities of visual translation using a variety of media and techniques. \\n Over the term, each successive project will provide the student the opportunity to develop and control a particular set of media, technique, and perspective, which reveals a unique and personal approach to image making. \\n Participation in critiques, discussions, and lectures will enable the student to become fluent with the vocabulary and language of drawing, and focus their preferred methods and developed skill-sets into appropriate and actionable processes.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Intermediate Drawing",
            "prefix": "ARTS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 3999
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4200,
            "description": "Advanced Drawing is designed to help students who have mastered basic drawing skills to enhance those skills and utilize them to explore visual ideas. Emphasis is placed on individual development of skills and subject matter to help students express themselves visually. Examples and studies are used from master drawings of the past to learn about the history of art and to stimulate ideas for the students’ own work.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Advanced Drawing",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4000
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4220,
            "description": "A painting course in opaque media such as oil or acrylic with emphasis on color interaction, composition, and pictorial design. Using sources from observation and the history of painting, students are taught to see and convey effects of color on/in 2D pictorial space and to develop critical skills in looking at paintings.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Painting",
            "prefix": "ARTS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4001
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4260,
            "description": "Life Drawing and Anatomy for Artists is an advanced drawing class that will focus on drawing the human figure. Students will work from live models to refine their drawing skills; clay models from anatomical texts will be made to develop a working knowledge of anatomy for artists. Gesture, proportion, and expression of the human figure will be emphasized; general concepts of design and composition will also be presented.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Life Drawing And Anatomy For Artists",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4002
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1110,
            "description": "This course focuses on the social and ecological aspects of humans in the natural world. It emphasizes critical thinking about where humans come from and where they are going as a species. The course draws on historical perspectives and addresses contemporary issues such as climate change, national energy resources, and the local foods movement. The course includes readings as well as student projects, field trips, guest lectures, and “ethnographic” assignments about this consumer society.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Nature And Society",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4003
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4300,
            "description": "Advancing environmental sustainability will depend on many kinds of expertise. In this course, students will explore the evolving terrain of green jobs and diverse sustainability-oriented career pathways that leverage the expertise they have developed through their undergraduate studies. The course provides students the opportunity to conduct research that examines where sustainability-oriented work is being done and how people with varied expertise are making a contribution.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Sustainability Careers",
            "prefix": "STSH",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4004
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4310,
            "description": "Through lectures and in-class discussions, this course explores the history, domestic and international politics, policy, philosophy, economics, environmental consequences, media coverage of, and alternatives to, the U.S. addiction to fossil fuels. Students, who may earn either humanities or social science credit, maintain analytical blogs with twice-weekly posts or write and present semester-length research papers, take a midterm exam and a comprehensive final exam. Satisfies the PDI II Requirement.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Energy Politics",
            "prefix": "STSH",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4005
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4310,
            "description": "Through lectures and in-class discussions, this course explores the history, domestic and international politics, policy, philosophy, economics, environmental consequences, media coverage of, and alternatives to, the U.S. addiction to fossil fuels. Students, who may earn either humanities or social science credit, maintain analytical blogs with twice-weekly posts or write and present semester-length research papers, take a midterm exam and a comprehensive final exam. Satisfies the PD II Requirement.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Energy Politics",
            "prefix": "STSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4006
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4260,
            "description": "This course provides students with a wide-ranging understanding of the environmental and social context of food, agriculture, and hunger. Drawing primarily on sociological concepts and research, the class will take a “food systems” approach, analyzing food as it travels from farm to table as part of an interconnected process. Students will examine why humans eat the way they do and how individuals’ food choices affect other people and the environment.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Food, Farms, And Famine",
            "prefix": "STSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4007
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4270,
            "description": "In this course, students will map the matrix of problems that make sustainability difficult – problems with the U.S. political, legal, and educational system, with media, culture, and individual behavior. Students will also identify sustainability pathways in transportation, urban design, education, alternative energy, etc. Throughout, students will analyze and try to produce effective environmental communication.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Sustainability Problems",
            "prefix": "STSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4008
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4280,
            "description": "This course examines needs for and challenges of delivering environmental education in different settings. Students critically review existing environmental education curricula then design and deliver their own to K-12 students. The history of public education in the United States, factors shaping contemporary education, various approaches to environmental education, and the complex challenge of interdisciplinary curriculum design are examined. Students in the course develop and demonstrate their own educational and environmental values.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Sustainability Education",
            "prefix": "STSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4009
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4320,
            "description": "What does resilience really mean and why does it matter? In this course, students will unpack the multiple meanings that make up “resilience” and learn about its relevance to human society. Upon entering the Anthropocene, climate change will ensure that sporadic, disruptive change will be the norm.  Disruptions will come on numerous levels and at a variety of scales. Is resilience about strengthening defenses so that “resilient” landscapes, infrastructure and organizations can bounce back, or is it more? Students will be asked to contribute to a collective understanding of how systems thinking and resilience thinking can help strengthen the ability to adapt and transform when humans are faced with social and ecological change. Can resilience planning help with the difficult conversations that are needed to balance the socio-economic and ecological trade-offs that the Anthropocene demands?",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Resilience Planning",
            "prefix": "STSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4010
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4350,
            "description": "A research seminar exploring the meaning of design in engineering, architecture, political theory, and other fields. How do social ideals and motives inspire design choices? To what extent does the design of human-made things shape the quality of public life? A variety of objects are studied: buildings, machines, artifacts in everyday use, computer programs, political constitutions, etc.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Politics Of Design",
            "prefix": "STSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4011
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4370,
            "description": "A highly interactive introduction to environmental politics and policy in the United States. Major themes include the background and context of environmental politics and policy, the policy-making process, environmental issues selected and reported on by students, the varieties of environmentalism, and environmental ethics.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Environmental Politics And Policy",
            "prefix": "STSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4012
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4500,
            "description": "This course surveys the actors, processes, and proposed solutions to the problems of environment and development. The theory and practice of three main themes are explored: the background and context of environment in North and South; politics and economic development in the south; and the problems and prospects for sustainable societies in North and South.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Globalization And Development",
            "prefix": "STSS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4013
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1175,
            "description": "How do people maintain a sense of well-being in their lives? Each person’s path to well-being in body and mind is unique—arising from an awareness of our needs, goals and what each finds fulfilling. The theme of curiosity will be used to explore what makes people tick, what makes them feel balanced, stressed, or calm. This interdisciplinary course uses practice-based learning, in-class writing, lectures, creative play, and reading.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Well-Being: Cultivating Curiosity",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4014
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1570,
            "description": "This course investigates the relationship between warfare and technology in historical and present-day settings. It will also cover how military technology might evolve in the future. In addition to considering the ways in which technology has changed the practices of warfare, the course will examine the ethical, political, social and economic problems and developments that have arisen from the intersection of military and technological change.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "War And Technology: Past, Present, And Future",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4015
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 1,
            "ID": 1965,
            "description": "Description",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Open Source: Art, Music, Culture",
            "prefix": "IHSS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4016
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4240,
            "description": "Eco Chic: Living Art is an upper level production and theory class about art, biology, and the study of life covering topics such as environmentalism, land art, food art, sustainable practices with art, body art, bio-art. Part lecture, part hands-on workshop, Eco Chic encourages students to redefine and experimentally express their relationships with the varied aspects of everyday living systems and manipulating life.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Eco-Chic: Living Art",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4017
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4960,
            "description": "Experimental courses offered for one or two semesters.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Bio-Punk: Arts Lab Practices",
            "prefix": "ARTS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4018
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4410,
            "description": "In this class, students will write on topics from their major discipline and investigate the kinds of texts that professionals in their field produce. They will identify and explore research questions, use discipline-specific library databases, and write research reports. In addition, they will develop effective note-taking and research skills and learn strategies for effective prose style.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Research Writing",
            "prefix": "WRIT",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4019
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2730,
            "description": "This is a survey course covering theories, methods, and empirical research on personal and situational factors influencing social behavior. Topics covered include social perception, the construction of social reality, decision making, group influences on behavior, and attitudes.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Social Psychology",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4020
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2800,
            "description": "An introduction to psychology as applied to sport; the topics covered include history of sport behavior, principles of learning and their application, anxiety and arousal, motivation, leadership, cohesion, audience effects, aggression, personality assessment, female athletes, youth in sport, coach behavior, and physical activity for all.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Introduction To Sports Psychology",
            "prefix": "PSYC",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4021
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2000,
            "description": "Any 2000-level psychology elective",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Psychology Elective",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 1
        },
        "model": "database.course",
        "pk": 4022
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4110,
            "description": "This course encompasses a broad spectrum of theories concerned with the biological, psychological, and social components of motivation. Throughout the course, students relate theoretical issues to both recent research evidence and potential practical applications to enhance performance. Group projects, focus group discussions, and interactive guest speakers are used to establish links between theory and performance.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Motivation And Performance",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4023
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4200,
            "description": "A broad introduction to the field of Industrial and Organizational Psychology. Topics covered include personnel selection, job analysis, training, performance appraisal, work-related attitudes, employee motivation, leadership, decision making, and organizational theory.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Industrial And Organizational Psychology",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4024
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4310,
            "description": "This course is the second in a two-semester sequence on research methods and statistics in the behavioral sciences. Students will learn how to analyze data using multiple regression, analysis of variance, factor analysis, principal component analysis, and multi-level linear modeling. Students will also gain proficiency with the R programming language and software environment for statistical computing. Each student will carry out a research project and prepare a formal report that comports with the guidelines from the American Psychological Association.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Research Methods And Statistics Ii",
            "prefix": "PSYC",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4025
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4400,
            "description": "Modern theories of personality are presented and compared. Using these theories, students analyze the processes by which people cope with intrapsychic, interpersonal, and institutional demands. Evidence on adaptive processes from clinical, field, and laboratory studies is evaluated.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Personality",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4026
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4450,
            "description": "The first half of this course is devoted to presentation of traditional theories of learning. Classical and operant conditioning and single-subject methodology are studied in depth. During the second half of the course, students apply their knowledge of operant conditioning principles in the context of a group-based field study.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Learning",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4027
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4720,
            "description": "The definition, history, major schools of thought, and models of the normal and abnormal personality are presented. Disorders are examined within the framework of D.S.M. and competing schools of thought. The description, etiology, treatment, including pharmacologic, and prevention of each of the disorders are considered. Illustrative cases are presented. Students write a paper on a topic, approved by the instructor, that focuses upon the impact of public policies on psychopathology.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Abnormal Psychology",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4028
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4740,
            "description": "Since the 1950’s, social science researchers have turned their attention to the courtroom, in order to test theories of human behavior in a real-world application. Are the basic assumptions underlying the practice of law in this country valid, given what psychologists know about the fundamentals of human behavior? This course will provide students with instruction regarding how the study of psychology can contribute to a better understanding of the legal system.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Psychology And The Law",
            "prefix": "PSYC",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4029
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4750,
            "description": "A practical introduction to the field of forensic psychology, a domain within psychology concerned with the production and application of psychological knowledge to the civil and criminal justice systems. This course explores the many ways in which psychological principles play an increasingly important role in influencing various processes and outcomes associated with the field of law.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Forensic Psychology",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4030
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4800,
            "description": "This course expands on topics covered in Introduction to Sport Psychology. Students in the course will work in small groups to identify and read literature in a course-relevant area of their choice. In addition to weekly written progress reports, students will prepare a final report that must be presented orally in class.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Sports Psychology Seminar",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4031
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4000,
            "description": "Any 4000-level psychology elective",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Psychology Elective",
            "prefix": "PSYC",
            "spring": 1,
            "summer": 1
        },
        "model": "database.course",
        "pk": 4032
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 2010,
            "description": "Intermediate Video is a hands-on intensive course that teaches the language, aesthetics, and techniques of video production. Working in groups and individually, students will develop and produce several short video projects. Emphasis will be on the acquisition of creative and technical production skills in visualizing, scripting, aesthetics, shooting, sound design, and editing.",
            "fall": 1,
            "major_restrictive": 0,
            "name": "Intermediate Video",
            "prefix": "ARTS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4033
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4250,
            "description": "Through direct experience in the community, this course explores the complex roles and relationships of art, education, and technology. Students will develop a plan to work with a media arts center, community organization, or school; final teams will produce real-world arts and education projects that ultimately will be realized as significant additions to their professional portfolio. The projects can include a range from traditional arts practice to creative writing, creative IT models, to community art and activism.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Art, Community And Technology",
            "prefix": "ARTS",
            "spring": 1,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4034
    },
    {
        "fields": {
            "CI": 0,
            "DI": 0,
            "HI": 0,
            "ID": 4630,
            "description": "The course introduces students to the art of writing and directing short videos, with an emphasis on generating ideas, and realizing them in a well-developed final project. Major theories and principles are studied through a comparative analysis of scripts and films. Students learn to work with actors, write their own scripts, and direct videos. Two final projects – a script and a video – will integrate all of the elements covered in class. Lecture/Practicum.",
            "fall": 0,
            "major_restrictive": 0,
            "name": "Writing And Directing For Video",
            "prefix": "ARTS",
            "spring": 0,
            "summer": 0
        },
        "model": "database.course",
        "pk": 4035
    }
]