[
    {
        "fields": {
            "pathDescript": "This pathway allows students to study a range of art history and media art histories and theories. This immersive study will give students a comprehensive view of how these histories have shaped our current day media and given rise to a variety of art making tools in our digital and computational era.",
            "pathName": "Arts History, Theory, And Criticism",
            "priority1": [
                3718,
                3719,
                3720,
                3721,
                3722,
                3723
            ],
            "priority2": [
                3718,
                3719,
                3720,
                3721,
                3722,
                3723
            ],
            "priority3": [
                3726
            ]
        },
        "model": "database.pathway",
        "pk": 436
    },
    {
        "fields": {
            "pathDescript": "Behavioral and cognitive neuroscience focus on understanding the brain mechanisms that allow humans and other animals to perceive, think, feel, remember, and act.  Students pursuing this pathway will cultivate an understanding of brain and behavior/cognition relationships by critically analyzing research findings.",
            "pathName": "Behavioral And Cognitive Neuroscience",
            "priority1": [
                3727
            ],
            "priority2": [
                3727
            ],
            "priority3": []
        },
        "model": "database.pathway",
        "pk": 437
    },
    {
        "fields": {
            "pathDescript": "Artificial Intelligence is quickly becoming pervasive in our lives. Study how Artificial Intelligence can benefit from concepts and ideas from cognitive science, and explore the ways in which Artificial Intelligence is changing our lives.",
            "pathName": "Artificial Intelligence",
            "priority1": [
                3705,
                3706,
                3707
            ],
            "priority2": [
                3705,
                3706,
                3707
            ],
            "priority3": [
                3709,
                3710,
                3711,
                3712,
                3713,
                3714,
                3715,
                3716,
                3717
            ]
        },
        "model": "database.pathway",
        "pk": 435
    },
    {
        "fields": {
            "pathDescript": "Integrated with Chinese culture, students will learn all four types of language skills (listening, speaking, reading, and writing). After completing the Chinese pathway, students will be able to communicate in Chinese at their targeted proficiency levels and think critically and creatively with global and multicultural awareness.",
            "pathName": "Chinese Language",
            "priority1": [
                3740,
                3741,
                3742
            ],
            "priority2": [
                3740,
                3741,
                3742
            ],
            "priority3": [
                3742,
                3743,
                3744
            ]
        },
        "model": "database.pathway",
        "pk": 438
    },
    {
        "fields": {
            "pathDescript": "This pathway looks at creative design and innovation from various humanities, arts, and social science points of view. Students will learn about the cognitive and communicative principles behind design and innovation, the economic policies, markets, and other social institutions driving and shaping design and innovation, and how to engage in sustainable and socially responsible design and innovation for local and global impact.",
            "pathName": "Creative Design And Innovation",
            "priority1": [
                3745,
                3746,
                3747,
                3748,
                3721,
                3749,
                3722,
                3750,
                3751,
                3752
            ],
            "priority2": [
                3745,
                3746,
                3747,
                3748,
                3721,
                3749,
                3722,
                3750,
                3751,
                3752
            ],
            "priority3": [
                3753,
                3754,
                3755,
                3756,
                3757,
                3758,
                3759,
                3760,
                3708,
                3761,
                3762,
                3763,
                3764,
                3765,
                3766,
                3767,
                3768,
                3769,
                3770
            ]
        },
        "model": "database.pathway",
        "pk": 439
    },
    {
        "fields": {
            "pathDescript": "The pathway in Design, Innovation, and Society (DIS) provides creative, socially conscious students deep context for a broad education in design and innovation. Students take a sequence of studio-based courses that address real-world social and environmental challenges.",
            "pathName": "Design, Innovation, And Society",
            "priority1": [
                3771
            ],
            "priority2": [
                3771
            ],
            "priority3": [
                3773,
                3774,
                3775
            ]
        },
        "model": "database.pathway",
        "pk": 440
    },
    {
        "fields": {
            "pathDescript": "Study different types of theories and statistical methods used by economists. Students are prepared to gain a broad understanding of how consumers, firms and governments make decisions, and their implications.",
            "pathName": "Economics",
            "priority1": [
                3776,
                3777
            ],
            "priority2": [
                3776,
                3777
            ],
            "priority3": [
                3781,
                3782,
                3783,
                3784,
                3785,
                3786,
                3787,
                3788,
                3789,
                3790,
                3791,
                3792,
                3793,
                3794,
                3795,
                3796,
                3797,
                3798,
                3799,
                3800,
                3801,
                3802,
                3803,
                3804,
                3805,
                3806,
                3807,
                3808,
                3809,
                3810,
                3811,
                3812,
                3813
            ]
        },
        "model": "database.pathway",
        "pk": 441
    },
    {
        "fields": {
            "pathDescript": "Study markets and policies in banking and finance. Students are prepared to use different types of mathematical models and econometric techniques used by economists to study the behavior of individuals, firms, and the economy.",
            "pathName": "Economics Of Banking & Finance",
            "priority1": [
                3776,
                3777
            ],
            "priority2": [
                3776,
                3777
            ],
            "priority3": [
                3784,
                3814,
                3804
            ]
        },
        "model": "database.pathway",
        "pk": 442
    },
    {
        "fields": {
            "pathDescript": "Study how individuals and firms make financial and economic decisions, and how those decisions might deviate from those predicted by traditional economic theory. Students are prepared to apply behavioral models of decision-making and experimental methods in economics.",
            "pathName": "Economics Of Decision-Making",
            "priority1": [
                3776,
                3777
            ],
            "priority2": [
                3776,
                3777
            ],
            "priority3": [
                3778,
                3793,
                3798,
                3802,
                3804,
                3806
            ]
        },
        "model": "database.pathway",
        "pk": 443
    },
    {
        "fields": {
            "pathDescript": "Study different types of markets related to pharmaceuticals, medical devices, and healthcare. Students are prepared to use theory, econometric models, and data to study the role of R&D, patents, innovation, and policies in healthcare markets, and in pharmaceuticals and medical devices.",
            "pathName": "Economics Of Healthcare Markets",
            "priority1": [
                3776,
                3777
            ],
            "priority2": [
                3776,
                3777
            ],
            "priority3": [
                3788,
                3798,
                3800
            ]
        },
        "model": "database.pathway",
        "pk": 444
    },
    {
        "fields": {
            "pathDescript": "Study different types of regulations and economic policy measures, and their impact on individuals, markets, and the economy. Students are prepared to use economic models, quantitative methods, and data to assess different types of regulations and policies, and their impact.",
            "pathName": "Economics Of Policy & Regulations",
            "priority1": [
                3776,
                3777
            ],
            "priority2": [
                3776,
                3777
            ],
            "priority3": [
                3786,
                3788,
                3794,
                3815
            ]
        },
        "model": "database.pathway",
        "pk": 445
    },
    {
        "fields": {
            "pathDescript": "Study different types of mathematical models and econometric techniques used in Economics. Students are prepared to use economic theory, and econometric and statistical methods to study behavior of individuals and firms in the economy.",
            "pathName": "Economics Of Quantitative Modeling",
            "priority1": [
                3776,
                3777
            ],
            "priority2": [
                3776,
                3777
            ],
            "priority3": [
                3816,
                3806,
                3808
            ]
        },
        "model": "database.pathway",
        "pk": 446
    },
    {
        "fields": {
            "pathDescript": "Study different types of economic models related to innovation and new technologies. Students are prepared to use economic theory, econometric and statistical methods, and data to examine patents, R&D, and innovation more broadly, as well as in specific industries in the economy.",
            "pathName": "Economics Of Technology & Innovation",
            "priority1": [
                3776,
                3777
            ],
            "priority2": [
                3776,
                3777
            ],
            "priority3": [
                3782,
                3800,
                3817
            ]
        },
        "model": "database.pathway",
        "pk": 447
    },
    {
        "fields": {
            "pathDescript": "This pathway allows students to study a range of approaches to electronic, or digital arts, such as digital imaging, graphic storytelling, interactive media, and 3D animation. This immersive study will give students a comprehensive view of how to use digital tools to tell stories, and to critically and creatively explore the arts at the intersection of the humanities, and the physical, computational, engineering, and social sciences.",
            "pathName": "Electronic Arts",
            "priority1": [
                3745,
                3818,
                3819,
                3820,
                3750,
                3751
            ],
            "priority2": [
                3745,
                3818,
                3819,
                3820,
                3750,
                3751
            ],
            "priority3": [
                3821,
                3822,
                3823,
                3824,
                3756,
                3825,
                3826,
                3827,
                3828,
                3760
            ]
        },
        "model": "database.pathway",
        "pk": 448
    },
    {
        "fields": {
            "pathDescript": "The future seems up for grabs as climate change challenges human and nonhuman societies to meet basic needs for clean air, water, soil, food, and energy. How will we adapt, reduce harm, or mitigate the problems of the past and present? This pathway involves courses in sustainability, defined as the means to ensure the well-being of the planet and quality of life of present and future generations. Courses integrate research and insights from the social sciences, arts, and humanities to pursue a healthy environment, economic prosperity, and social justice by building on the present to inform the future.",
            "pathName": "Environmental Futures",
            "priority1": [
                3748,
                3829,
                3776,
                3830,
                3831,
                3832,
                3833,
                3834,
                3835
            ],
            "priority2": [
                3748,
                3829,
                3776,
                3830,
                3831,
                3832,
                3833,
                3834,
                3835
            ],
            "priority3": [
                3836,
                3837,
                3838,
                3839,
                3794,
                3840,
                3841,
                3842,
                3843,
                3769,
                3770,
                3844,
                3845,
                3846,
                3847,
                3848
            ]
        },
        "model": "database.pathway",
        "pk": 449
    },
    {
        "fields": {
            "pathDescript": "In this Pathway, students analyze many aspects of the complex relationship between ethics and areas in science, technology, and engineering. These conversations are critical to ensure the ethical and accessible use of technology and to allow scientists and engineers to think critically and make informed decisions on personal, professional, and public policy levels.",
            "pathName": "Ethics, Integrity, And Social Responsibility",
            "priority1": [
                3705,
                3849,
                3850,
                3832,
                3851,
                3835,
                3852,
                3853,
                3854
            ],
            "priority2": [
                3705,
                3849,
                3850,
                3832,
                3851,
                3835,
                3852,
                3853,
                3854
            ],
            "priority3": [
                3836,
                3839,
                3855,
                3840,
                3856,
                3841,
                3842,
                3857,
                3858,
                3859,
                3860
            ]
        },
        "model": "database.pathway",
        "pk": 450
    },
    {
        "fields": {
            "pathDescript": "This pathway explores the design, creation, and analysis of games.  Students completing this pathway will develop depth in creative and critical thinking, technological proficiency and multicultural awareness.",
            "pathName": "Game Studies",
            "priority1": [
                3900
            ],
            "priority2": [
                3900
            ],
            "priority3": [
                3901,
                3902,
                3903
            ]
        },
        "model": "database.pathway",
        "pk": 454
    },
    {
        "fields": {
            "pathDescript": "A pathway for those who are curious about what makes something fake or factual and how such concepts are evolving in contemporary political and popular culture. Students will learn how to think more precisely and analytically about the distinctions between fact, fiction, truth, and reality.",
            "pathName": "Fact And Fiction",
            "priority1": [
                3746,
                3850,
                3720,
                3873,
                3874,
                3875,
                3876,
                3877,
                3878,
                3879
            ],
            "priority2": [
                3746,
                3850,
                3720,
                3873,
                3874,
                3875,
                3876,
                3877,
                3878,
                3879
            ],
            "priority3": [
                3880,
                3855,
                3881,
                3882,
                3883,
                3884,
                3885,
                3886,
                3866,
                3867,
                3887,
                3888,
                3889,
                3890,
                3891,
                3892,
                3893
            ]
        },
        "model": "database.pathway",
        "pk": 452
    },
    {
        "fields": {
            "pathDescript": "Humans can do, and have done, some really stupid things: we are not as rational as we would like to think, and we are subject to scores of cognitive and social biases. That said, however, we also have the power to correct for these, and to do good and constructive work. Let's see how we can harness our cognitive and social powers for the good. How can critical thinking be used constructively? How can we learn from our past mistakes? How can social institutions and policies be set up to ensure that we will make wise decisions and create a world that lasts into the extended future?",
            "pathName": "Extent And Limits Of Rationality",
            "priority1": [
                3705,
                3776,
                3861,
                3862,
                3863,
                3864
            ],
            "priority2": [
                3705,
                3776,
                3861,
                3862,
                3863,
                3864
            ],
            "priority3": [
                3708,
                3865,
                3793,
                3798,
                3866,
                3867,
                3868,
                3717,
                3869,
                3870,
                3871,
                3872
            ]
        },
        "model": "database.pathway",
        "pk": 451
    },
    {
        "fields": {
            "pathDescript": "This pathway promotes the development of skills to help students effectively communicate both domestically, and internationally, as well as enhance appreciation for other cultures. Students who select this pathway must have all courses that are part of the pathway be in the same foreign language.",
            "pathName": "Foreign Language",
            "priority1": [
                3894,
                3895
            ],
            "priority2": [
                3894,
                3895
            ],
            "priority3": [
                3742,
                3743,
                3744,
                3898,
                3899
            ]
        },
        "model": "database.pathway",
        "pk": 453
    },
    {
        "fields": {
            "pathDescript": "This pathway enables students to cultivate an appreciation of how diverse identities are lived, experienced, and analyzed. Courses in this pathway center gender, dis/ability, race/ethnicity, and social class as ways of knowing and as analytic approaches for understanding distinctions that human societies make and unmake over time. Gender is used as an analytic tool for critical thinking about such topics as studies of sex differences and sexualities; race and gender in science, engineering, or gaming; or studies of the environment, war and peace, and other social impacts. Racial-ethnic formation is similarly used as an analytical tool for visualizing intersecting inequalities; history of science, medicine, arts, and technology.",
            "pathName": "Gender, Race, Sexuality, Ethnicity, And Social Change",
            "priority1": [
                3849,
                3720,
                3873,
                3904,
                3905,
                3906,
                3907,
                3752
            ],
            "priority2": [
                3849,
                3720,
                3873,
                3904,
                3905,
                3906,
                3907,
                3752
            ],
            "priority3": [
                3838,
                3908,
                3883,
                3909,
                3910,
                3911,
                3912,
                3913,
                3914
            ]
        },
        "model": "database.pathway",
        "pk": 455
    },
    {
        "fields": {
            "pathDescript": "The Interactive Media/Data Design pathway covers communication design theory and practice, interaction design theory and practice, and information design to prepare students for creating different forms of interactive, multimedia communication and data representation. Students use critical thinking, creative thinking, multimedia design, and data representation to develop effective forms of communication in diverse global contexts.",
            "pathName": "Interactive Media/Data Design",
            "priority1": [
                3873,
                3865,
                3915,
                3940,
                3941,
                3917,
                3942,
                3943,
                3918,
                3921
            ],
            "priority2": [
                3873,
                3865,
                3915,
                3940,
                3941,
                3917,
                3942,
                3943,
                3918,
                3921
            ],
            "priority3": [
                3873,
                3865,
                3915,
                3940,
                3941,
                3917,
                3942,
                3943,
                3918,
                3921
            ]
        },
        "model": "database.pathway",
        "pk": 459
    },
    {
        "fields": {
            "pathDescript": "This pathway examines different forms of expression and their cultural contexts in a variety of media, including film, television, photography, and new media. Its components will enhance creative and critical thinking, communication practices, and awareness of cultural and individual identities. The focus on cultural and media literacy will improve the career readiness and social awareness of those in any program at RPI.",
            "pathName": "Media And Culture",
            "priority1": [
                3967,
                3874,
                3968,
                3876,
                3877,
                3750,
                3751,
                3878,
                3752,
                3969,
                3880,
                3882,
                3970,
                3883,
                3865,
                3971,
                3972,
                3884,
                3909,
                3973,
                3974
            ],
            "priority2": [
                3967,
                3874,
                3968,
                3876,
                3877,
                3750,
                3751,
                3878,
                3752,
                3969,
                3880,
                3882,
                3970,
                3883,
                3865,
                3971,
                3972,
                3884,
                3909,
                3973,
                3974
            ],
            "priority3": [
                3967,
                3874,
                3968,
                3876,
                3877,
                3750,
                3751,
                3878,
                3752,
                3969,
                3880,
                3882,
                3970,
                3883,
                3865,
                3971,
                3972,
                3884,
                3909,
                3973,
                3974
            ]
        },
        "model": "database.pathway",
        "pk": 464
    },
    {
        "fields": {
            "pathDescript": "This pathway is designed to train versatile, critical, and self-possessed 21st- century communicators. Students who successfully complete this pathway will demonstrate the ability to make focused, audience-appropriate arguments; communicate effectively across diverse rhetorical, sociocultural, and disciplinary contexts; and respond creatively to the analytical demands involved with developing, arranging, and revising ideas and arguments.",
            "pathName": "Strategic Communication",
            "priority1": [
                3993,
                3994,
                3865,
                3762,
                3973,
                3910,
                3967,
                3995,
                3921,
                3939,
                3871,
                3996
            ],
            "priority2": [
                3993,
                3994,
                3865,
                3762,
                3973,
                3910,
                3967,
                3995,
                3921,
                3939,
                3871,
                3996
            ],
            "priority3": [
                3993,
                3994,
                3865,
                3762,
                3973,
                3910,
                3967,
                3995,
                3921,
                3939,
                3871,
                3996
            ]
        },
        "model": "database.pathway",
        "pk": 469
    },
    {
        "fields": {
            "pathDescript": "We live in the age of information … and misinformation … of big data, data mining, and machine learning ... of new media presenting unparalleled means of communication ... of unseen and opaque algorithms driving our news feeds... and of rushing to judgment on viral videos.  We better all develop some 'information intelligence' and 'data dexterity'. Such dexterity and intelligence includes technical skills of quantitative data analysis and IT technology, but also includes critical thinking skills regarding how information is collected, judged, interpreted, and represented, and how big data and information is feeding our collective awareness driving our decisions and affecting the world around us.",
            "pathName": "Living In A World Of Data",
            "priority1": [
                3705,
                3849,
                3850,
                3776,
                3932,
                3933
            ],
            "priority2": [
                3705,
                3849,
                3850,
                3776,
                3932,
                3933
            ],
            "priority3": [
                3941,
                3917,
                3918,
                3793,
                3798,
                3808,
                3866,
                3867,
                3960,
                3961,
                3962,
                3963
            ]
        },
        "model": "database.pathway",
        "pk": 462
    },
    {
        "fields": {
            "pathDescript": "The Literature and Creative Writing Pathway offers discussion-oriented courses across a range of literary genres and themes, with a choice of emphasis on either literature, creative writing, or both. Students will learn to read and write literary art critically and creatively, with clarity and imagination, and with sensitivity to multi-cultural expressions of diversity.",
            "pathName": "Literature And Creative Writing",
            "priority1": [
                3949,
                3878,
                3882,
                3765,
                3950,
                3951,
                3952,
                3953,
                3954,
                3955,
                3886,
                3956,
                3957,
                3921,
                3958,
                3959,
                3892,
                3893,
                3943
            ],
            "priority2": [
                3949,
                3878,
                3882,
                3765,
                3950,
                3951,
                3952,
                3953,
                3954,
                3955,
                3886,
                3956,
                3957,
                3921,
                3958,
                3959,
                3892,
                3893,
                3943
            ],
            "priority3": [
                3949,
                3878,
                3882,
                3765,
                3950,
                3951,
                3952,
                3953,
                3954,
                3955,
                3886,
                3956,
                3957,
                3921,
                3958,
                3959,
                3892,
                3893,
                3943
            ]
        },
        "model": "database.pathway",
        "pk": 461
    },
    {
        "fields": {
            "pathDescript": "Students gain historical and inter-cultural knowledge of music from the Western and various non-Western cultures.",
            "pathName": "Music And Culture",
            "priority1": [
                3977,
                3719,
                3722,
                3905,
                3833,
                3750,
                3751,
                3969
            ],
            "priority2": [
                3977,
                3719,
                3722,
                3905,
                3833,
                3750,
                3751,
                3969
            ],
            "priority3": [
                3978,
                3979,
                3980,
                3756,
                3981,
                3982,
                3760
            ]
        },
        "model": "database.pathway",
        "pk": 466
    },
    {
        "fields": {
            "pathDescript": "The pathway in Information Technology and Web Science (ITWS) is designed to introduce students to the social aspects and human interactions that technology provides in our lives and workplaces.  Students will gain knowledge of the social, legal, and ethical issues in employing technology around the world and will learn how to recognize and respond to human-centered deisgn issues to make technology more usable.",
            "pathName": "Information Technology And Web Sciences",
            "priority1": [
                3932,
                3933,
                3934
            ],
            "priority2": [
                3932,
                3933,
                3934
            ],
            "priority3": [
                3725,
                3708,
                3865,
                3915,
                3776,
                3935,
                3936,
                3937,
                3854,
                3938,
                3939,
                3871
            ]
        },
        "model": "database.pathway",
        "pk": 458
    },
    {
        "fields": {
            "pathDescript": "Study Graphic Design through the integration of theory and practice, in print and digital media. Students are prepared to use creative and critical thinking to solve visual communication problems and reach target audiences with words, symbols and images.",
            "pathName": "Graphic Design",
            "priority1": [
                3873,
                3749,
                3865,
                3763,
                3915,
                3765,
                3916,
                3917,
                3918,
                3767,
                3919,
                3920,
                3921
            ],
            "priority2": [
                3873,
                3749,
                3865,
                3763,
                3915,
                3765,
                3916,
                3917,
                3918,
                3767,
                3919,
                3920,
                3921
            ],
            "priority3": [
                3873,
                3749,
                3865,
                3763,
                3915,
                3765,
                3916,
                3917,
                3918,
                3767,
                3919,
                3920,
                3921
            ]
        },
        "model": "database.pathway",
        "pk": 456
    },
    {
        "fields": {
            "pathDescript": "Study linguistics from various perspectives, from cognitive analysis of linguistic expressions to the use of language for communication and other social settings. You’ll also learn how to effectively communicate and handle foreign languages.",
            "pathName": "Linguistics",
            "priority1": [
                3944,
                3948
            ],
            "priority2": [
                3944,
                3948
            ],
            "priority3": [
                3945,
                3946,
                3713,
                3908,
                3910,
                3947
            ]
        },
        "model": "database.pathway",
        "pk": 460
    },
    {
        "fields": {
            "pathDescript": "The pathway in History is designed for students interested in US and world history. Courses primarily focus on the social history and evolution of technology, scientific enterprise, medicine, and law.",
            "pathName": "History",
            "priority1": [
                3831,
                3922,
                3923,
                3924,
                3925,
                3907,
                3878,
                3853,
                3854
            ],
            "priority2": [
                3831,
                3922,
                3923,
                3924,
                3925,
                3907,
                3878,
                3853,
                3854
            ],
            "priority3": [
                3927,
                3928,
                3929,
                3930,
                3931,
                3888,
                3889,
                3844,
                3845
            ]
        },
        "model": "database.pathway",
        "pk": 457
    },
    {
        "fields": {
            "pathDescript": "The pathway in Science, Technology, and Society (STS) is designed for students broadly interested in the social and political dimensions of science, technology, engineering, and medicine. Students use political and social science methods to investigate scientific and technological developments.",
            "pathName": "Science, Technology, And Society",
            "priority1": [
                3932,
                3933,
                3752,
                3853,
                3854
            ],
            "priority2": [
                3932,
                3933,
                3752,
                3853,
                3854
            ],
            "priority3": [
                3926,
                3990,
                3912,
                3913,
                3857,
                3991,
                3992
            ]
        },
        "model": "database.pathway",
        "pk": 468
    },
    {
        "fields": {
            "pathDescript": "Learn to reason more precisely, think more critically, and ask more penetrating and foundational questions, about enduring and contemporary problems in ethics, science, technology, religion, and politics — including some of the biggest challenges that humanity currently faces.",
            "pathName": "Philosophy",
            "priority1": [
                3879,
                3983,
                3849,
                3850,
                3984,
                3707,
                3985,
                3866,
                3867,
                3868
            ],
            "priority2": [
                3879,
                3983,
                3849,
                3850,
                3984,
                3707,
                3985,
                3866,
                3867,
                3868
            ],
            "priority3": [
                3986,
                3987,
                3887,
                3860,
                3840,
                3988,
                3964,
                3989
            ]
        },
        "model": "database.pathway",
        "pk": 467
    },
    {
        "fields": {
            "pathDescript": "This Pathway is for students with an interest in symbolic logic, and the connections between formal logic and mathematics, computer science, Artificial Intelligence, and the human mind.",
            "pathName": "Logical Thinking",
            "priority1": [
                3707,
                3705,
                3868,
                3964,
                3965,
                3966,
                3717,
                3866,
                3867
            ],
            "priority2": [
                3707,
                3705,
                3868,
                3964,
                3965,
                3966,
                3717,
                3866,
                3867
            ],
            "priority3": [
                3707,
                3705,
                3868,
                3964,
                3965,
                3966,
                3717,
                3866,
                3867
            ]
        },
        "model": "database.pathway",
        "pk": 463
    },
    {
        "fields": {
            "pathDescript": "Discover Cognitive Science: a young but fast-growing field focused on the study of mind from the perspectives of philosophy, psychology, neuroscience, linguistics, and artificial intelligence.",
            "pathName": "Mind, Brain, And Intelligence",
            "priority1": [
                3708
            ],
            "priority2": [
                3708
            ],
            "priority3": [
                3705,
                3706,
                3707,
                3732,
                3735,
                3975,
                3717,
                3961,
                3869,
                3976
            ]
        },
        "model": "database.pathway",
        "pk": 465
    },
    {
        "fields": {
            "pathDescript": "The ability to understand and predict how people act and think is more important than ever in addressing many of the greatest challenges that we face as a society.  In this pathway, students will learn how behavior and thought are influenced by cognitive, emotional, developmental, social, and environmental factors, and how to apply psychological principles.",
            "pathName": "Understanding Human Behavior",
            "priority1": [
                3727
            ],
            "priority2": [
                3727
            ],
            "priority3": [
                3728,
                3960,
                4020,
                4021,
                4022,
                4023,
                4024,
                4025,
                3961,
                3869,
                4026,
                4027,
                3733,
                4028,
                4029,
                4030,
                4031,
                4032
            ]
        },
        "model": "database.pathway",
        "pk": 473
    },
    {
        "fields": {
            "pathDescript": "How do we maintain a sense of well-being in our lives? Each person’s path to well-being in body and mind is unique—arising from an awareness of our needs, goals and what we find fulfilling. The Well-being Interdisciplinary Pathway includes a wide variety of courses that explore the nature of what it is to be human and to orient ourselves in the world, to have relationships, make decisions, be creative, and make discoveries.",
            "pathName": "Well-Being: Body And Mind",
            "priority1": [
                3997,
                3829,
                3705,
                4014,
                3722
            ],
            "priority2": [
                3997,
                3829,
                3705,
                4014,
                3722
            ],
            "priority3": []
        },
        "model": "database.pathway",
        "pk": 475
    },
    {
        "fields": {
            "pathDescript": "This pathway offers instruction in identifying and understanding the methods and media for scientific knowledge is dissemination. Students who successfully complete this pathway will demonstrate the ability to critique how textual and social representations create diverse and competing receptions of scientific knowledge; analyze the social construction of scientific knowledge; and solve problems through disseminating scientific knowledge across a variety of social and rhetorical contexts.",
            "pathName": "Thinking With Science",
            "priority1": [
                3850,
                4014,
                4015,
                4016,
                3853,
                3854
            ],
            "priority2": [
                3850,
                4014,
                4015,
                4016,
                3853,
                3854
            ],
            "priority3": [
                4017,
                4018,
                3865,
                3886,
                3866,
                3867,
                3986,
                3887,
                3929,
                3870,
                3939,
                4019,
                3872
            ]
        },
        "model": "database.pathway",
        "pk": 472
    },
    {
        "fields": {
            "pathDescript": "The pathway in Sustainability focuses on the interactions between various systems - social, political, cultural, economic, technological and ecological - that undergird environmental sustainability. Students use interdisciplinary approaches to investigate environmental problems.",
            "pathName": "Sustainability",
            "priority1": [
                4003,
                3830,
                3831,
                3835,
                3853,
                3854
            ],
            "priority2": [
                4003,
                3830,
                3831,
                3835,
                3853,
                3854
            ],
            "priority3": [
                4004,
                3856,
                3929,
                3843,
                3769,
                3770,
                4005,
                4006,
                3844,
                3845,
                4007,
                4008,
                4009,
                4010,
                4011,
                4012,
                4013
            ]
        },
        "model": "database.pathway",
        "pk": 471
    },
    {
        "fields": {
            "pathDescript": "This pathway allows students to study video, performance and social impact through the integration of theory and practice. Students are prepared to analyze and critique moving images; plan, produce and edit their own media productions in video/television and/or performance; and communicate through visual as well as audio mediums. Strategically situating art, media and technology in a social context, students engage in creative practice designed to make change from the local to the global.",
            "pathName": "Video, Performance, And Social Practice",
            "priority1": [
                3746,
                3720,
                3874,
                3819,
                3748,
                3864,
                3751,
                3969
            ],
            "priority2": [
                3746,
                3720,
                3874,
                3819,
                3748,
                3864,
                3751,
                3969
            ],
            "priority3": [
                4034,
                3726,
                4017,
                3855,
                3760
            ]
        },
        "model": "database.pathway",
        "pk": 474
    },
    {
        "fields": {
            "pathDescript": "Study traditional studio arts such as drawing, painting, sculpture in conjunction with art history to learn techniques, history and theory in the visual arts.  Students will develop basic skills in perspective, proportion, composition, form making, light and shadow, color, 2 and 3D Design, and learn to articulate ideas about their own, other students’, and historical works through class discussions and critiques.",
            "pathName": "Studio Arts",
            "priority1": [
                3818,
                3725
            ],
            "priority2": [
                3818,
                3725
            ],
            "priority3": [
                3999,
                4000,
                3758,
                4001,
                4002
            ]
        },
        "model": "database.pathway",
        "pk": 470
    }
]